{
  "post_id": "34333",
  "post_url": "https://thezman.com/wordpress/?p=34333",
  "total_comments": 256,
  "scraped_at": "2025-08-21T23:13:53.420031",
  "post_title": "The Legume Revolution",
  "post_datetime": "2025-06-11T08:17:44-05:00",
  "post_categories": [
    {
      "name": "Badder Thoughts",
      "url": "https://thezman.com/wordpress/?cat=10"
    },
    {
      "name": "Culture",
      "url": "https://thezman.com/wordpress/?cat=4"
    },
    {
      "name": "Politics",
      "url": "https://thezman.com/wordpress/?cat=8"
    }
  ],
  "post_content": "<div class=\"entry-content\">\n<p><strong>Note:</strong> Last night I was on a <a href=\"https://x.com/BWLH_/status/1931815578010079673\" rel=\"noopener\" target=\"_blank\">Twitter Space</a> with Paul Kersey, Peter Brimelow, Harrison Smith, and Dan Lyman. The topic will be how best to remove the alien invaders.</p>\n<p>Tonight, the two most moderate men on the internet, myself and Paul Ramsey, will be striking the reasonable tone on the Legume Revolution. You can watch on <a href=\"https://x.com/ramzpaul\" rel=\"noopener\" target=\"_blank\">Twitter</a>, <a href=\"https://t.co/f0ZX2xXOPr\" rel=\"noopener\" target=\"_blank\">YouTube</a> or <a href=\"https://t.co/aVLC1hv48m\" rel=\"noopener\" target=\"_blank\">Rumble</a>.</p>\n<hr/>\n<p>Since Trump arrived for a second turn at the wheel, everyone has been wondering when the Blob would make its move against him. The one thing we know about these people is they never take no for an answer. Every setback is met with a new round of schemes against their enemies. The relatively muted response to this point has had many people scratching their heads. The invader riots in Los Angeles that are spreading to other cities appear to be the long-awaited response.</p>\n<p>At this point, it is clear that the Los Angeles riot is synthetic. The internet is full of images and videos showing professionally trained rioters. For example, whenever you see college aged white girls with whistles at one of these things, you know the army of not-for-profits has their people on the ground training protestors. The whistle is a common, low-tech item for professional protestors. It is often used to alert the lawyers stationed at the protest to come to the area.</p>\n<p>There is also the fact that the mayor of Los Angeles, Karen Bass, was on the board of the National Endowment for Democracy. This is one of the main hubs of the Blob, primarily used to stage color revolutions around the world. When Bass was in Congress she was on a committee that had the job of overseeing NED, while she was also their most senior board member. Of course, the color revolution queen, Victoria Nuland, is currently a senior Blob person at NED.</p>\n<p>It appears that the plan is to replay the Summer of Floyd, but this time with little brown guys as the fig leaf for the project. The George Floyd riots were also a manufactured crisis, organized by white activists. They caught fire and became a series of race riots, where blacks burned down their own neighborhoods, but the general operation was run out of Washington. This time they are trying get the migrants and brown activists worked up into a ghetto riot.</p>\n<p>That is looking to be a problem for a number of reasons. One is the scenes of masked men waving Mexican flags while standing on burned out cars was obviously a repeat of the scenes of blacks standing on destroyed police cars. For some reason, the people involved think this is good politics. It is bad politics because it is bad optics. In this case, it highlights the fact that our rulers abetted an invasion. Seeing foreigners celebrate in American cities like this just hardens attitudes toward immigration.</p>\n<p>The other problem they have, and it is clear from the videos, is that the immigrants are not willing to riot like blacks. Legal immigrants are in favor and tough measures against illegals and the illegals have no interest in making it easier to get grabbed by the police and put on a bus back home. That leaves the rioting to the twenty-something white losers the Blob relies on as foot soldiers. Now, the blacks are taking advantage of the opportunity and looting the sneaker stores.</p>\n<p>Perhaps the biggest problem for the Blob this time is the world has wised up to the color revolution rackets. Lately, they keep failing because everyone understands that these things are not organic. The authorities focus on the support networks in the same way you would attack an army’s supply lines. That was what we saw in the Caucasian country of Georgia last year. The government thwarted the Blob by going after the foreign networks operating inside the country.</p>\n<p>The Trump White House has learned the same lessons, which is why they went after USAID on day one. That has hampered the Blob’s ability to subvert, but the Blob has access to lots of resources besides USAID. It seems the White House anticipated this, as well, which is why they were ready for these legume riots. Note that they keep escalating whenever the Blob people make threats. The response to Los Angeles is the same escalatory dominance the Blob likes to employ.</p>\n<p>So far, this strategy is paying off the White House. The public overwhelmingly supports a tough response to these actions. The public sees foreign men waving foreign flags in an American city, while fighting with the police. The public naturally expects the government to send in the army. The White House being ahead of the curve on this makes Trump look strong and decisive. The Blob people mewing about it look weak and dishonest, rather than self-righteous.</p>\n<p>There is also a secondary issue here. The center of gravity on immigration has been quickly moving in the sensible direction as the public has become fed up with the invasion and more aware of the details. These riots and the Trump response has put the foot on the accelerator. Suddenly, the edgy position in normie politics is a total ban on all immigration, not just illegal immigration. Trump himself is starting to look like a squishy moderate on the immigration issue.</p>\n<p>Of course, the thing looming over all of this is the change that occurred in the oligarch class over the last year. During the Summer of Floyd, they were happy to join in on the chaos, so they could feel like one of the folks. They were all waving the flags and chanting the chants. Things are different now and the main reason is they see in their own world the risk automation brings. The AI revolution that has captivated them has also made plain the problem of too many people.</p>\n<p>When they think of AI, they imagined the acres of cubicles suddenly emptied out, replaced by robots in the server farm. Those coders, engineers and support people will need something to do soon. AI may turn out to be a fantasy, but it could also be a tragic turn for the oligarchs, if we suddenly have millions of unemployed smart people, wondering how they are going to pay their bills. The scenes they now see in Los Angeles could just as easily be in their neighborhood.</p>\n<p>The Legume Revolution is just starting, so it is too soon to know how this thing will playout over the coming months. The conditions are clearly different from those leading to the Summer of Floyd. It is also clear that the Trump admin is better too. On the other hand, the Blob people are relentless. Like a drug-resistant virus, they must be completely eradicated to make sure they do not return. There is much to be done on that score, but this crisis could be a step in that direction.</p>\n<hr/>\n<p>If you like my work and wish to donate, you can <a href=\"https://www.buymeacoffee.com/mujolulu\" rel=\"noopener\" target=\"_blank\">buy me a beer</a>. You can sign up for a <a href=\"https://www.subscribestar.com/the-z-blog\" rel=\"noopener\" target=\"_blank\">SubscribeStar</a> or a <a href=\"https://thedissident.substack.com/\" rel=\"noopener\" target=\"_blank\">Substack</a> subscription and get some extra content. You can donate via <a href=\"https://www.paypal.com/donate/?cmd=_s-xclick&amp;hosted_button_id=UDAS2Q8JYA6CN&amp;source=url\" rel=\"noopener\" target=\"_blank\">PayPal</a>. My crypto addresses are <a href=\"https://thezman.com/wordpress/?page_id=22713\" rel=\"noopener\" target=\"_blank\">here</a> for those who prefer that option. You can send gold bars through the postal service to: Z Media LLC P.O. Box 1047 Berkeley Springs, WV 25411-3047. Thank you for your support!</p>\n<hr/>\n</div>",
  "website_comment_count": 256,
  "comments": [
    {
      "id": "461098",
      "author": "David Wright",
      "comment": "The analogy to the left actions being a drug resistant virus is accurate. To extend that line of thinking, what are we told to do when prescribed Amoxicillin? Take all the pills, don’t quit when you start to feel better.\nRun through these riots Soylent Green style. Then attack the treasonous and perfidious organizations until they are destroyed. Ruin people like Bass, Newsome, Soros , whoever is our enemy. It’s a war for survival now. Finish the antibiotic.",
      "datetime": "June 11, 2025 8:30 am",
      "vote_up": 75,
      "vote_down": 0,
      "reply_to": null,
      "responses": [
        {
          "id": "461105",
          "author": "The Wild Geese Howard",
          "comment": "I grew up in the 80s, so I’d prefer it if these incidents were handledBlue Thunderstyle.",
          "datetime": "June 11, 2025 8:40 am",
          "vote_up": 23,
          "vote_down": 0,
          "reply_to": "461098",
          "responses": [
            {
              "id": "461204",
              "author": "Alzaebo",
              "comment": "I never grew up, so I had to google Blue Thunder.I denounce myself as a pawn of the System!",
              "datetime": "June 11, 2025 11:46 am",
              "vote_up": 5,
              "vote_down": 0,
              "reply_to": "461105",
              "responses": [
                {
                  "id": "461310",
                  "author": "The Wild Geese Howard",
                  "comment": "Alz-\nNo worries.\nThe movie is worth watching for Roy Scheider at his ascerbic best.\nHere is a small teaser:\nhttps://youtu.be/4oAf47oWHy4",
                  "datetime": "June 11, 2025 5:45 pm",
                  "vote_up": 2,
                  "vote_down": 0,
                  "reply_to": "461204",
                  "responses": []
                }
              ]
            }
          ]
        },
        {
          "id": "461123",
          "author": "Jack Dodson",
          "comment": "Yeah, my main concern has been that like most responses and actions from what passes for the Right, this would be half-ass. I’m seeing an extremely well-coordinated program with an end goal in mind. Will it work? Maybe. But few are the times that answer would not have been “no.”",
          "datetime": "June 11, 2025 9:09 am",
          "vote_up": 11,
          "vote_down": 0,
          "reply_to": "461098",
          "responses": []
        },
        {
          "id": "461129",
          "author": "ray",
          "comment": "Your mind to God’s ears.",
          "datetime": "June 11, 2025 9:15 am",
          "vote_up": 2,
          "vote_down": 0,
          "reply_to": "461098",
          "responses": []
        },
        {
          "id": "461161",
          "author": "Compsci",
          "comment": "“Then attack the treasonous and perfidious organizations until they are destroyed. Ruin people like Bass, Newsome, Soros…”This, and only this will work.  Work this situation as one works drug dealing in the street.  Hurl horrendous changes at the low level operatives in the street.  Do a “Jan 6” on them—no State charges—Fed only, no bail, no contact, no speedy trial.  Hold them until they give up their upper level organizers/bosses.  Arrest them as well and work your way back up the chain of command until you hit the top.What you reward you get more of, that’s a well understood “given”.  What seems not so well understood is that actions which you fail to punish, you get more of as well.  These low level rioters are expendable and their bosses know that.  Arresting them and only them is equivalent to squeezing a balloon—it will only expand elsewhere.  You need to pop it to make it go away.  There will never be a time where the nation is more supportive in these efforts than now.",
          "datetime": "June 11, 2025 10:30 am",
          "vote_up": 39,
          "vote_down": 0,
          "reply_to": "461098",
          "responses": [
            {
              "id": "461218",
              "author": "ray",
              "comment": "This.Eventually, you will reach a ceiling beyond which you will not be able to prosecute and imprison . . . Soros et al.  But in the process, you will have destroyed nearly ALL the NGO woke-fem organizations, and jailed for long terms everybody except the billionaire elite backers.And when it comes to the American women deeply embedded in these treasonous organizations, they have to be crushed too.  ‘Oh she’s just a girl’ time has passed for the neutered Right.  ‘Just a girl’ and her lackeys have been oppressing men and boys for 50 years, whilst thrilling to their empowerment.  That must end permanently.The Untouchables will be dealt with in due time, if I have to throw their evil asses into hell myself.  But right now we are fighting for the right to exist without persecution in our own nation.  That’s a big enough chunk to start.",
              "datetime": "June 11, 2025 12:08 pm",
              "vote_up": 26,
              "vote_down": 0,
              "reply_to": "461161",
              "responses": []
            },
            {
              "id": "461272",
              "author": "Felix Krull",
              "comment": "This, and only this will work.\nYes, but it’s only half of the equation. The other half is grassroots work – adult grassroots work, not dropping banners or screaming at people with bullhorns or larping as SA, but the hard, boring task of taking back the institutions from the ground up.\nA handful of dedicated guys willing to work 15-20 hours a week, could coup most school boards in a few months.",
              "datetime": "June 11, 2025 2:35 pm",
              "vote_up": 7,
              "vote_down": 0,
              "reply_to": "461161",
              "responses": [
                {
                  "id": "461286",
                  "author": "Jack Dodson",
                  "comment": "The reasons the commies usually go Year Zero is the difficulty inherent in reform of existing systems.",
                  "datetime": "June 11, 2025 3:37 pm",
                  "vote_up": 5,
                  "vote_down": 0,
                  "reply_to": "461272",
                  "responses": [
                    {
                      "id": "461329",
                      "author": "Felix Krull",
                      "comment": "It’s most likely because they already control the institutions, so they don’t care that waving placards and screaming into bullhorns and annoying random normies doesn’t actually work.If we dismantled the entire political superstructure we’d have to build ourselves a new one and if you ask me, it’d have to look pretty much like the old one, at least on the local level. I figure that taking them back and perhaps tweaking them a bit, is easier than building new ones.And never mind the minuscule political influence it gains you, the important bit is that there’s a lot of institutions (government and non) with a budget that you can use to give jobs, contracts and subsidies to your friends, or subvert the same way that the Sierra Club has been subverted into a pro-immigration org.The problem is that doing political community work is mind-explodingly boring, and it takes a lot of time, sitting through endless committee meeting, reading minutes and studying law codes, it eats up ressources that few people have.But ourguys have plenty of time for gay and narcissistic stuff like fitness and health and gardening and baking and lactofermenting and dieting and homesteading and a bigod cat videos, rather than making videos about how to coup your town council democratically or how to start your own political party or posting war stories from your local school board that you and your extremist pal got elected last year.",
                      "datetime": "June 11, 2025 11:07 pm",
                      "vote_up": 3,
                      "vote_down": 0,
                      "reply_to": "461286",
                      "responses": [
                        {
                          "id": "461389",
                          "author": "Alzaebo",
                          "comment": "My gods, Krull. That’s how they did it. That’s exactly how they did it. That’s how they got so rich, so powerful, so connected.\nThey targeted .gov revenue streams and built out a support system.\nThat’s how they were able to stomach the endless hours on blithering bullshit. A white guy wants to make things work for their intended purpose, but a shithead just wants an “in”, like some internet scam.",
                          "datetime": "June 12, 2025 9:32 am",
                          "vote_up": 2,
                          "vote_down": 0,
                          "reply_to": "461329",
                          "responses": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "461162",
          "author": "Tars Tarkas",
          "comment": "The best tool for the job, IMHO, is lawfare and rico charges against all the organizations behind all this bs.  Yes, criminal charges against the politicians publicly endorsing all the rioting and mayhem.\nWhat they want, expect and are prepared for is sending in the national guard.  They would love a Kent State incident.  They would love viral videos of people getting effed up by the police or guard or military.  What they don’t want is lawfare against important people.",
          "datetime": "June 11, 2025 10:30 am",
          "vote_up": 34,
          "vote_down": 0,
          "reply_to": "461098",
          "responses": [
            {
              "id": "461164",
              "author": "Grant",
              "comment": "Truly. We already have the tools to do it. The left showed us how. We just have to “J6” anyone and everyone that had anything to do with these riots. The biggest hurdle for this is getting normiecons not to care about the “hypocrisy” of it.",
              "datetime": "June 11, 2025 10:33 am",
              "vote_up": 24,
              "vote_down": 0,
              "reply_to": "461162",
              "responses": [
                {
                  "id": "461170",
                  "author": "Tars Tarkas",
                  "comment": "What hypocrisy?  “The left” started it.  Plus, these are criminal organizations which aid and abet criminal activity like rioting.\nCon, Inc hates winning, so they may very well complain, but normal people want this to happen.   They are tired of these rent-a-mobs turning cities upside down on demand.  People are tired of antifa. People hate seeing Mexicans flying Mexican flags burning down the city.  There has never been a better time for lawfare.",
                  "datetime": "June 11, 2025 10:46 am",
                  "vote_up": 28,
                  "vote_down": 0,
                  "reply_to": "461164",
                  "responses": [
                    {
                      "id": "461201",
                      "author": "george 1",
                      "comment": "Agreed.  Watched the CHP officer get hit in the head by a chunk of cement.    This is a real deal insurrection so as far as I am concerned the area where that projectile came from should have been liberally sprayed with some real bullets.",
                      "datetime": "June 11, 2025 11:40 am",
                      "vote_up": 20,
                      "vote_down": 0,
                      "reply_to": "461170",
                      "responses": [
                        {
                          "id": "461250",
                          "author": "Tars Tarkas",
                          "comment": "Unfortunately, that is what they want.  They could not care less about their pets other than when the FO portion of FAFO leads to ugly footage.  Then they parade the ugly footage, totally out of context and makes out the cops to be a fascist occupying force.  Then they get arrested and charged in a show trial meant to demoralize the cops and other forces of civilization.  Besides, there are 10k of that weirdo right behind him.What we need to do is get to the problem at the source.  The organizers and the financiers.  You cannot just shut them down. They need to go to prison for long periods and have all their assets seized.  FFS, we live in a country where cops literally rob people on the side of the road and in airports and other places all on behalf of the state.  If we can take 500 Dollars from D’Quan because they suspect the cash of being used in a crime, they can take the money from these criminal organizations.",
                          "datetime": "June 11, 2025 1:01 pm",
                          "vote_up": 7,
                          "vote_down": 0,
                          "reply_to": "461201",
                          "responses": [
                            {
                              "id": "461263",
                              "author": "george 1",
                              "comment": "Absolutely!!",
                              "datetime": "June 11, 2025 1:46 pm",
                              "vote_up": 2,
                              "vote_down": 0,
                              "reply_to": "461250",
                              "responses": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "461172",
                  "author": "Pickle Rick",
                  "comment": "That’s the thing we have now that Normies worship- Capital A Authority. Normie has proven he will absolutely accept anything, from the Skittles Brigade to Negroes, to Karens, and full on totalitarianism during Covid-as long as it is Authority he’s bending over for. We have the Authority now and to be blunt, fuck Normie’s opinions.",
                  "datetime": "June 11, 2025 10:49 am",
                  "vote_up": 36,
                  "vote_down": 0,
                  "reply_to": "461164",
                  "responses": [
                    {
                      "id": "461202",
                      "author": "george 1",
                      "comment": "I like the normies.  They are nice people for the most part.   I wish they weren’t so damned retarded.",
                      "datetime": "June 11, 2025 11:44 am",
                      "vote_up": 21,
                      "vote_down": 0,
                      "reply_to": "461172",
                      "responses": []
                    },
                    {
                      "id": "461210",
                      "author": "Jack Dodson",
                      "comment": "Strong Horse/Weak Horse. Bin Laden was 100 percent correct.",
                      "datetime": "June 11, 2025 11:50 am",
                      "vote_up": 9,
                      "vote_down": 0,
                      "reply_to": "461172",
                      "responses": []
                    },
                    {
                      "id": "461303",
                      "author": "Xman",
                      "comment": "Normies love cops (unfortunately). But at least it works in our favor when the brown people and the illegals attack the cops.",
                      "datetime": "June 11, 2025 5:20 pm",
                      "vote_up": 3,
                      "vote_down": 0,
                      "reply_to": "461172",
                      "responses": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "461200",
              "author": "george 1",
              "comment": "Maybe people won’t care about the mobs being shot this time.",
              "datetime": "June 11, 2025 11:36 am",
              "vote_up": 13,
              "vote_down": 0,
              "reply_to": "461162",
              "responses": [
                {
                  "id": "461213",
                  "author": "Alzaebo",
                  "comment": "Would a song called “Waco’s Revenge” get popular?",
                  "datetime": "June 11, 2025 11:56 am",
                  "vote_up": 5,
                  "vote_down": 0,
                  "reply_to": "461200",
                  "responses": []
                },
                {
                  "id": "461592",
                  "author": "Ostei Kozelskii",
                  "comment": "Precisely. As intolerance becomes the default attitude toward immigration, support becomes the common stance toward violence against the subversives. But it’s still a somewhat risky strategy.",
                  "datetime": "June 13, 2025 9:12 am",
                  "vote_up": 0,
                  "vote_down": 0,
                  "reply_to": "461200",
                  "responses": []
                }
              ]
            },
            {
              "id": "461232",
              "author": "Pozymandias",
              "comment": "In a way, I hope the rioting spreads to Port-a-Potty (Portland). It would be lovely seeing the whole worthless gynocracy of Oregon rolled off to federal prison or Gitmo. Hell, lock up the whole OR state legislature too. Fuck ’em.\nWhat the normies don’t realize is that our society underwent a very real revolution in the late 1960s that has been ongoing for decades. It needs to be rolledALLthe way back.",
              "datetime": "June 11, 2025 12:27 pm",
              "vote_up": 15,
              "vote_down": 0,
              "reply_to": "461162",
              "responses": [
                {
                  "id": "461298",
                  "author": "ray",
                  "comment": "Good attitude.\nAnd yep, ALL of the Sickties Revolution destroyed or severely curtailed. I was wrong and got zoomed, like many others. But I see the light now.\nDown with the fem agenda, the race agenda, and absolutely no more homo worship. No more pitting one element of society against another. The D.C. punks, intel, and corporate interests that continue to play this game of playing off hatreds = prison or execution. Enough.",
                  "datetime": "June 11, 2025 4:59 pm",
                  "vote_up": 4,
                  "vote_down": 0,
                  "reply_to": "461232",
                  "responses": []
                }
              ]
            },
            {
              "id": "461383",
              "author": "sfgermane",
              "comment": "There is no rioting and mayhem.  You’ll never get an official on record admitting to it.  The elites are all declaring that it’s AI deepfaked. They are just waiting for their Kent State moment and will claim (with full confidence) it was unwarranted aggression against an innocent bystander.",
              "datetime": "June 12, 2025 9:25 am",
              "vote_up": 0,
              "vote_down": 0,
              "reply_to": "461162",
              "responses": []
            }
          ]
        },
        {
          "id": "461189",
          "author": "Robbo",
          "comment": "Yep. Trump’s response will only be deemed a success if he roots out EVERY one of these evil NGOs, cut’s their funding and throws their organisers in prison. And that includes Soros. He needs to put Sleepy Kash, Bongino and Blondie on two weeks notice of dismissal if they don’t get their backsides in gear on this.",
          "datetime": "June 11, 2025 11:14 am",
          "vote_up": 27,
          "vote_down": 0,
          "reply_to": "461098",
          "responses": [
            {
              "id": "461203",
              "author": "george 1",
              "comment": "Don’t forget AIPAC.",
              "datetime": "June 11, 2025 11:46 am",
              "vote_up": 14,
              "vote_down": 0,
              "reply_to": "461189",
              "responses": []
            },
            {
              "id": "461223",
              "author": "ray",
              "comment": "The reason you don’t put Patel and Blondie in high positions of authority is that their loyalty is divided, from the getgo. America is an Identity Nation now.\nPatel will side with Indian invasion and Blondie will side with the feminists, as she is a feminist too. Like all women in power in the U.S.\nEven after taking a bullet, Donald just does not get this. Or more likely, he doesn’t want to get it.  It’s a bridge too far psychologically for someone living in 1982.",
              "datetime": "June 11, 2025 12:16 pm",
              "vote_up": 23,
              "vote_down": 0,
              "reply_to": "461189",
              "responses": [
                {
                  "id": "461285",
                  "author": "Jack Dodson",
                  "comment": "This.",
                  "datetime": "June 11, 2025 3:35 pm",
                  "vote_up": 8,
                  "vote_down": 0,
                  "reply_to": "461223",
                  "responses": []
                }
              ]
            }
          ]
        },
        {
          "id": "461300",
          "author": "Bilejones",
          "comment": "Trump should have started on day one by indicting Starmer for interfering in US elections.He’s on Video bragging about it.The US/UK have a watertight extradition treaty, Ask Assange.Starmer’s not a Head of State, that would be Chuck the Turd, Starmers just a government functionary.It would be a hoot.",
          "datetime": "June 11, 2025 5:15 pm",
          "vote_up": 11,
          "vote_down": 0,
          "reply_to": "461098",
          "responses": [
            {
              "id": "461318",
              "author": "ray",
              "comment": "That little bitch Starmer actually threatened Americans who won’t bow to the Agenda like he did.  Threatened to prosecute them.\nYou are so right. That b.s. requires an immediate response from the U.S. head of State, and that means Donald. A STFU should have been issued publicly to that little scumbag.",
              "datetime": "June 11, 2025 7:16 pm",
              "vote_up": 6,
              "vote_down": 0,
              "reply_to": "461300",
              "responses": []
            }
          ]
        }
      ]
    },
    {
      "id": "461116",
      "author": "Dr_Mantis_Tobbogan_MD",
      "comment": "If we put down the riots in L.A., fine. But the NGOs that pay for these pallets of bricks and their donors need to be prosecuted under RICO. You’d only have to prosecute one billionaire for donating to these termites for the rest to fall in line. Bill Gates has my nomination for the first billionaire to be frog-marched in an orange jumpsuit to prison.I remember in high school American history reading about the so-called “robber barons.” Sure, they were unethical and greedy, but at least some of them tried to do some good, like the Carnegie libraries.Our oligarchs’ contribution to society is chaos and disorder. Their perversion and evil is offensive.",
      "datetime": "June 11, 2025 8:56 am",
      "vote_up": 61,
      "vote_down": 0,
      "reply_to": null,
      "responses": [
        {
          "id": "461134",
          "author": "ray",
          "comment": "‘But the NGOs that pay for these pallets of bricks and their donors need to be prosecuted under RICO’\nAbsolutely essential.  Speedy trials, convictions, and long prison terms, while it’s all fresh in the public mind.",
          "datetime": "June 11, 2025 9:28 am",
          "vote_up": 18,
          "vote_down": 0,
          "reply_to": "461116",
          "responses": [
            {
              "id": "461325",
              "author": "Chris",
              "comment": "Another factor in this being speed is of the essence is that fact that by and large, the American public has pretty much had it with the uber-wealthy stirring the pot of shit and then hiding in their gated estates while average neighborhoods burn.Trot both Soros’ in front of a jury while explaining in detail how their money has been used to subvert the will of the voter, as well as being used to destroy their own country and watch both of those cretins get put away for long time. Hell, the old man alone with his Bond villain accent won’t last a minute.",
              "datetime": "June 11, 2025 8:38 pm",
              "vote_up": 6,
              "vote_down": 0,
              "reply_to": "461134",
              "responses": [
                {
                  "id": "461328",
                  "author": "ray",
                  "comment": "Sounds good to me.  I think Soros is out of reach presently but who knows, that might change.",
                  "datetime": "June 11, 2025 10:48 pm",
                  "vote_up": 2,
                  "vote_down": 0,
                  "reply_to": "461325",
                  "responses": []
                }
              ]
            }
          ]
        },
        {
          "id": "461177",
          "author": "Carl B.",
          "comment": "I nominate that *itch heiress that owns Wal-Mart .",
          "datetime": "June 11, 2025 10:59 am",
          "vote_up": 18,
          "vote_down": 0,
          "reply_to": "461116",
          "responses": [
            {
              "id": "461206",
              "author": "george 1",
              "comment": "May the lice of a thousand camels infect her nether regions.",
              "datetime": "June 11, 2025 11:48 am",
              "vote_up": 12,
              "vote_down": 0,
              "reply_to": "461177",
              "responses": []
            },
            {
              "id": "461211",
              "author": "Jeffrey Zoar",
              "comment": "I had a brief thought of boycotting wally world, but then I had a hard time thinking of a chain grocery that doesn’t promote faggotry, dieversity, and the GR somehow or another",
              "datetime": "June 11, 2025 11:50 am",
              "vote_up": 7,
              "vote_down": 0,
              "reply_to": "461177",
              "responses": [
                {
                  "id": "461594",
                  "author": "Ostei Kozelskii",
                  "comment": "There is scarcely a corporation of any sort that isn’t a part of globohomo. Every one of the big execs must swing.",
                  "datetime": "June 13, 2025 9:22 am",
                  "vote_up": 0,
                  "vote_down": 0,
                  "reply_to": "461211",
                  "responses": []
                }
              ]
            },
            {
              "id": "461234",
              "author": "ray",
              "comment": "Seconded. That monopoly — pals with commie China –needs busting.",
              "datetime": "June 11, 2025 12:30 pm",
              "vote_up": 3,
              "vote_down": 0,
              "reply_to": "461177",
              "responses": []
            },
            {
              "id": "461255",
              "author": "Tars Tarkas",
              "comment": "The entire Walton family, the board and everyone else involved in management in Walmart needs to be sent to a concentration camp and ALL of their assets seized. Walmart was instrumental in de-industrializing the US.Starting in the late 90s Walmart was forcing manufacturers in the US to relocate to China. “Your prices are too high. This is all we will pay and this is how you outsource your manufacturing to China”They also play all kinds of tax games. They literally argue in court that their buildings are so shoddily built they have negative value and are not subject to property taxes. Then, finally when they’ve bled a community of all they are worth, they shutter the store and leave it there for the municipality to clean up.",
              "datetime": "June 11, 2025 1:09 pm",
              "vote_up": 25,
              "vote_down": 0,
              "reply_to": "461177",
              "responses": [
                {
                  "id": "461301",
                  "author": "ray",
                  "comment": "Before the evils of K-Mart and Wal-Mart, AMERICAN CITIZENS used to run sports, clothing, shoes, appliances and other businesses.That meant dad had a job, so HEALTHY families — not single-mother ‘families’ — could form and pass wealth to succeeding generations. Extended families were common in this setup.Then the corporations took over everything by undercutting the mom ‘n pop stores downtown, where we all used to shop — spend money. Then they finished-off the family business with their Scamdemic.Wal-Mart is pure evil. Destroys towns, makes family formation difficult or impossible, ships manufacturing to foreign and enemy countries. Wal-Mart is a disease within.Family net worth: $247 billion. Last I checked the Walton brood made more money than the bottom 30% of Americans combined. That is what Scripture calls ‘iniquity’ and it must be stamped out with combat boots on.",
                  "datetime": "June 11, 2025 5:17 pm",
                  "vote_up": 16,
                  "vote_down": 0,
                  "reply_to": "461255",
                  "responses": []
                }
              ]
            }
          ]
        },
        {
          "id": "461179",
          "author": "ProZNo",
          "comment": "I’d start looking at the ex-Mrs Gates and the ex-Mrs Bezos.\n”Hell hath no fury”. They’ll burn down the nation and retreat to Europe just to spite their ex.",
          "datetime": "June 11, 2025 11:02 am",
          "vote_up": 19,
          "vote_down": 0,
          "reply_to": "461116",
          "responses": []
        },
        {
          "id": "461192",
          "author": "Robbo",
          "comment": "I have little confidence in Patel and Bongino, etc. Hope I’m wrong. People are so done with this crap.",
          "datetime": "June 11, 2025 11:18 am",
          "vote_up": 20,
          "vote_down": 0,
          "reply_to": "461116",
          "responses": [
            {
              "id": "461235",
              "author": "Reversion to the mean",
              "comment": "Washington, Hamilton,Jefferson,Adams …Patel, Bongino.  LMAO.",
              "datetime": "June 11, 2025 12:31 pm",
              "vote_up": 12,
              "vote_down": 0,
              "reply_to": "461192",
              "responses": []
            },
            {
              "id": "461268",
              "author": "Dr_Mantis_Tobbogan_MD",
              "comment": "They remind me of the “top men” that will be researching the Ark of the Covenant at the end of Raiders of the Lost Ark.",
              "datetime": "June 11, 2025 2:16 pm",
              "vote_up": 11,
              "vote_down": 0,
              "reply_to": "461192",
              "responses": []
            },
            {
              "id": "461557",
              "author": "Luther's Turd",
              "comment": "Both failed to uphold their promises to clean up the corrupt mess. I suspect they’ve been threatened or are just liars. Probably both.\nLuther’s Turd",
              "datetime": "June 12, 2025 9:02 pm",
              "vote_up": 0,
              "vote_down": 0,
              "reply_to": "461192",
              "responses": []
            }
          ]
        }
      ]
    },
    {
      "id": "461107",
      "author": "Citizen of a Silly Country",
      "comment": "The call for banning 3rd world immigration is clever. Sure, we all want a complete moratorium, but this is good optics, and it moves the window. Normies could be convinced that we can’t assimilate people from cultures too foreign to our own.\nOf course, the key is designating India to be 3rd world.",
      "datetime": "June 11, 2025 8:42 am",
      "vote_up": 53,
      "vote_down": 0,
      "reply_to": null,
      "responses": [
        {
          "id": "461111",
          "author": "TempoNick",
          "comment": "I’d rather have Mexicans than Indians.",
          "datetime": "June 11, 2025 8:51 am",
          "vote_up": 36,
          "vote_down": 0,
          "reply_to": "461107",
          "responses": [
            {
              "id": "461127",
              "author": "Citizen of a Silly Country",
              "comment": "Agree. But the key is getting the ball rolling in the right direction. Once you get people accepting bans on immigration, it’s not hard to start including any and all countries.",
              "datetime": "June 11, 2025 9:12 am",
              "vote_up": 33,
              "vote_down": 0,
              "reply_to": "461111",
              "responses": [
                {
                  "id": "461165",
                  "author": "Compsci",
                  "comment": "You can ameliorate the situation by picking at it, rather than halting it completely.  For example, end “chain migration” under the guise of vetting all legal immigrants.  Vetting in this case meaning not automatically admitting relatives just because you got into the country legally in the past.  Another example is that we have a “lottery” where we admit 50k legal migrants per year simply “because”!  It’s only fair you know.\nLord knows how much shenanigans goes on behind the scenes in the legal immigration half of the problem.",
                  "datetime": "June 11, 2025 10:36 am",
                  "vote_up": 13,
                  "vote_down": 0,
                  "reply_to": "461127",
                  "responses": [
                    {
                      "id": "461169",
                      "author": "TempoNick",
                      "comment": "You guys are way wrong on this chain migration thing. If you are going to admit somebody to be an American, then they have to get all the benefits of being an American, the biggest and most important benefit being having extended family around them. Extended family is an important social circle and helps integrate them into a brand new culture and society.Extended family also makes it less likely that they end up on the government dole. Countless businesses have been started and are sustained by having the family pitch in. You lose your job, you have somebody to go to to help you pay the mortgage until you can get a new one. You’re effectively an orphan without having family members around.",
                      "datetime": "June 11, 2025 10:44 am",
                      "vote_up": 0,
                      "vote_down": -56,
                      "reply_to": "461165",
                      "responses": [
                        {
                          "id": "461182",
                          "author": "Compsci",
                          "comment": "Total bullshit.You migrate based upon your own merit.  You prove you are an asset to this country.  You leave your past behind as far as this country is concerned.  You want to visit your relatives, fine.  You want to send them some money to help out, fine.  You want us to grant them full citizenship rights, because you are a citizen—bullshit.You want your wife and children to come in because you got citizenship…how about a non-citizenship continuing VISA for them?  That’s what they do everywhere else.  Example China, Japan, Korea…My father came here from Europe.  He became an American after a 5 year vetting process.  He met my mother here and married.  There was no sponsorship of his “relatives” for automatic entry.  We visited the “old country” every so often.  If he was so home sick, he was allowed to remigrate back to the “old country” and take his wealth with him (he didn’t).Really Nick, where the hell do you come up with this shit?",
                          "datetime": "June 11, 2025 11:05 am",
                          "vote_up": 29,
                          "vote_down": 0,
                          "reply_to": "461169",
                          "responses": [
                            {
                              "id": "461195",
                              "author": "TempoNick",
                              "comment": "Not at all bullshit. You’ve got your parents, your kids, your siblings around you, and most people benefit from that. But you’re going to throw some guy who mops floors to the dogs without any family support system around them? And let’s not forget that this tears at the family fabric of this country. You’re going to bring in a bunch of loners with nobody around them to care about them or to care about. Is that the kind of society you want?At least when you bring your mom here, you have somebody to babysit the kids. You don’t have to go on government assistance to help you with your child care in a place where your kid is going to get molested.Chain migration is good. We just need to be selective of the people up front.",
                              "datetime": "June 11, 2025 11:19 am",
                              "vote_up": 0,
                              "vote_down": -35,
                              "reply_to": "461182",
                              "responses": [
                                {
                                  "id": "461219",
                                  "author": "Alzaebo",
                                  "comment": "Why the f*** do we have to care about anybody other than our own people? I notice you aren’t advocating for British or German or Afrikaaner families.",
                                  "datetime": "June 11, 2025 12:08 pm",
                                  "vote_up": 28,
                                  "vote_down": 0,
                                  "reply_to": "461195",
                                  "responses": [
                                    {
                                      "id": "461227",
                                      "author": "TempoNick",
                                      "comment": "If you want desirable people, they’re going to want to have their family around.\nYou can’t have it both ways. If you want the loners who aren’t family-oriented and have no support system, you’re going to get the border jumpers and people just come here for money. You seriously want loners in what has previously been a family country?\nI didn’t realize you were all libertarians.",
                                      "datetime": "June 11, 2025 12:23 pm",
                                      "vote_up": 0,
                                      "vote_down": -25,
                                      "reply_to": "461219",
                                      "responses": [
                                        {
                                          "id": "461245",
                                          "author": "Compsci",
                                          "comment": "Again, a gratuitous assertion without supporting evidence.  You’ve no idea how many “relatives” are imported under current “chain migration” law.  Are they all a part of the support structure you claim is needed?As I related, my father came here before all this nonsense and had no problem “adjusting” to the lack of relatives residing in close proximity.  And if this is a “deal killer” for the migration applicant, then let him live and thrive in his own country.  You also fail to address the alternative I suggested, that of continued residency without “citizenship” possibility for  immediate family (wife/children) only.Of course, an emotional argument is all you have here.  Vapid to the extreme.  However there is one benefit to your postings—all can see and note what a traitorous/disingenuous White sounds like and believes.",
                                          "datetime": "June 11, 2025 12:50 pm",
                                          "vote_up": 11,
                                          "vote_down": 0,
                                          "reply_to": "461227",
                                          "responses": [
                                            {
                                              "id": "461277",
                                              "author": "Wiffle",
                                              "comment": "TempoNick is some sort of Eastern European who is here because his family is here now. He likes to advise us Americans on all aspects of our lives, when he’s not busy calling us the biggest maroons on the planet and being bitter that Dad was “only” a union carpenter. He needs extra family members to bolster the argument.",
                                              "datetime": "June 11, 2025 3:16 pm",
                                              "vote_up": 9,
                                              "vote_down": 0,
                                              "reply_to": "461245",
                                              "responses": [
                                                {
                                                  "id": "461284",
                                                  "author": "TempoNick",
                                                  "comment": "You could learn a few things from us, Sheets. Like how to get along with your kin.",
                                                  "datetime": "June 11, 2025 3:35 pm",
                                                  "vote_up": 0,
                                                  "vote_down": -13,
                                                  "reply_to": "461277",
                                                  "responses": []
                                                },
                                                {
                                                  "id": "461558",
                                                  "author": "Luther's Turd",
                                                  "comment": "Probably a freeloader from the Ukraine…\nLuther’s Turd",
                                                  "datetime": "June 12, 2025 9:06 pm",
                                                  "vote_up": 0,
                                                  "vote_down": 0,
                                                  "reply_to": "461277",
                                                  "responses": []
                                                }
                                              ]
                                            },
                                            {
                                              "id": "461283",
                                              "author": "TempoNick",
                                              "comment": "My mom was separated from her dad who was in this country from 1939 until 1952. That sucked. My dad married my mom and got legal status. He brought my uncle, my aunt, my grandmother. We also had cousins here, All fairly successful. That was great if for no other reason than to have somebody come to your funeral when you die.",
                                              "datetime": "June 11, 2025 3:34 pm",
                                              "vote_up": 0,
                                              "vote_down": -12,
                                              "reply_to": "461245",
                                              "responses": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "461239",
                                  "author": "Compsci",
                                  "comment": "“Chain migration is good.”\nOne gratuitous assertion is validly refuted by another.\nNo, chain migration is not good!",
                                  "datetime": "June 11, 2025 12:37 pm",
                                  "vote_up": 15,
                                  "vote_down": 0,
                                  "reply_to": "461195",
                                  "responses": []
                                },
                                {
                                  "id": "461275",
                                  "author": "Tars Tarkas",
                                  "comment": "“You’ve got your parents, your kids, your siblings around you, and most people benefit from that.”This isn’t even true. 2% of Americans make an interstate move every freakin year.  We are as isolated as any alien.  Friends and family accessible by only telephone and email and such.“But you’re going to throw some guy who mops floors to the dogs without any family support system around them”They can always go home.  WTF is the point of moving out of your country to mop floors?  They are not just mopping floors because you really cannot support yourself mopping floors.  They have other grifts or criminal activity to support themselves.“Chain migration is good.”Let us know when we’re back to Western European immigrants only.A family of Mexicans is worse than a single Mexican and far better if ALL OF THEM are back safely in Mexico.",
                                  "datetime": "June 11, 2025 2:41 pm",
                                  "vote_up": 11,
                                  "vote_down": 0,
                                  "reply_to": "461195",
                                  "responses": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "461188",
                          "author": "KGB",
                          "comment": "You’re unaware of the generational welfare problem that exists in states like NY.",
                          "datetime": "June 11, 2025 11:13 am",
                          "vote_up": 20,
                          "vote_down": 0,
                          "reply_to": "461169",
                          "responses": [
                            {
                              "id": "461246",
                              "author": "Compsci",
                              "comment": "Nick is unaware of many things, but alas feels the need to comment upon such.",
                              "datetime": "June 11, 2025 12:52 pm",
                              "vote_up": 6,
                              "vote_down": 0,
                              "reply_to": "461188",
                              "responses": []
                            }
                          ]
                        },
                        {
                          "id": "461217",
                          "author": "Alzaebo",
                          "comment": "They don’t integrate into the culture, they bring their village with them culture intact.  Look at that picture of the extended Indian horde again.",
                          "datetime": "June 11, 2025 12:03 pm",
                          "vote_up": 25,
                          "vote_down": 0,
                          "reply_to": "461169",
                          "responses": [
                            {
                              "id": "461228",
                              "author": "TempoNick",
                              "comment": "Perhaps, but if you look at the Italians and the Germans and everybody else from Europe who brought their families over, they integrated pretty well.",
                              "datetime": "June 11, 2025 12:24 pm",
                              "vote_up": 0,
                              "vote_down": -20,
                              "reply_to": "461217",
                              "responses": [
                                {
                                  "id": "461238",
                                  "author": "BigJimSportCamper",
                                  "comment": "We’re not talking about White European Christians, we’re talking about third world dregs. Holy crap some people are thick.",
                                  "datetime": "June 11, 2025 12:34 pm",
                                  "vote_up": 22,
                                  "vote_down": 0,
                                  "reply_to": "461228",
                                  "responses": [
                                    {
                                      "id": "461287",
                                      "author": "TempoNick",
                                      "comment": "What kind of cruel people are you that you want to break up families?The point is still that if you bring them into this country legally, they should have the same advantages Americans have. That includes having family around.",
                                      "datetime": "June 11, 2025 3:37 pm",
                                      "vote_up": 0,
                                      "vote_down": -24,
                                      "reply_to": "461238",
                                      "responses": [
                                        {
                                          "id": "461306",
                                          "author": "Bilejones",
                                          "comment": "It’s the Dago who moves who breaks up his family, Dickhead.",
                                          "datetime": "June 11, 2025 5:28 pm",
                                          "vote_up": 6,
                                          "vote_down": 0,
                                          "reply_to": "461287",
                                          "responses": [
                                            {
                                              "id": "461332",
                                              "author": "TempoNick",
                                              "comment": "Dickheads are the people like you, who won’t let someone bring his parents and children over.",
                                              "datetime": "June 12, 2025 12:24 am",
                                              "vote_up": 0,
                                              "vote_down": -3,
                                              "reply_to": "461306",
                                              "responses": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "461242",
                                  "author": "Georgia",
                                  "comment": "Most of their “families” were still in the Old Country – true as to Irish and Italians…I know I came from that",
                                  "datetime": "June 11, 2025 12:41 pm",
                                  "vote_up": 7,
                                  "vote_down": 0,
                                  "reply_to": "461228",
                                  "responses": []
                                },
                                {
                                  "id": "461247",
                                  "author": "Compsci",
                                  "comment": "Now you take first worlders (European Whites) and compare them to third worlders muds.  You also are clueless that most of this migration came before the revision of immigration law in 1965 which created “chain migration” and restricted most Whites from entering (while increasing third world entry),  thereby reducing a White counter balance to the chain migration of muds.",
                                  "datetime": "June 11, 2025 12:57 pm",
                                  "vote_up": 11,
                                  "vote_down": 0,
                                  "reply_to": "461228",
                                  "responses": []
                                },
                                {
                                  "id": "461559",
                                  "author": "Luther's Turd",
                                  "comment": "Yep, a uko.\nLuther’s Turd",
                                  "datetime": "June 12, 2025 9:08 pm",
                                  "vote_up": 0,
                                  "vote_down": 0,
                                  "reply_to": "461228",
                                  "responses": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "461221",
                          "author": "Paintersforms",
                          "comment": "America was about leaving the Old World behind and taking your chances, until it wasn’t. One of those essential parts of American identity we lost and risk losing our nation over.",
                          "datetime": "June 11, 2025 12:13 pm",
                          "vote_up": 12,
                          "vote_down": 0,
                          "reply_to": "461169",
                          "responses": []
                        },
                        {
                          "id": "461226",
                          "author": "ray",
                          "comment": "No we don’t want the invaders’ extended families in America with them, on the grounds that mebbe, just mebbe, it’ll make them Better American Citizens.\nYou can’t be that naive.",
                          "datetime": "June 11, 2025 12:21 pm",
                          "vote_up": 24,
                          "vote_down": 0,
                          "reply_to": "461169",
                          "responses": []
                        },
                        {
                          "id": "461264",
                          "author": "Mikew",
                          "comment": "Chain migration, more than anything else, spells the end of the USA.",
                          "datetime": "June 11, 2025 1:53 pm",
                          "vote_up": 9,
                          "vote_down": 0,
                          "reply_to": "461169",
                          "responses": []
                        },
                        {
                          "id": "461296",
                          "author": "Gunners",
                          "comment": "On the 150th birthday of Canada in 2017, the state broadcaster CBC aired a feel-good story about a Somali man who, since his arrival in Canada in 1997, gradually brought 150 family members into the country.",
                          "datetime": "June 11, 2025 4:48 pm",
                          "vote_up": 9,
                          "vote_down": 0,
                          "reply_to": "461169",
                          "responses": [
                            {
                              "id": "461331",
                              "author": "TempoNick",
                              "comment": "Obviously, I’m against that, which is why the solution is to be picky about who you let in, in the first place.",
                              "datetime": "June 12, 2025 12:23 am",
                              "vote_up": 0,
                              "vote_down": -4,
                              "reply_to": "461296",
                              "responses": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "461174",
                      "author": "Tars Tarkas",
                      "comment": "A moratorium is needed, but still not enough.  We need mass deportations and conditions to encourage self-deportation.\nThe authorities need to be imposing massive fines (and prison) for every single illegal alien they employ in any capacity unless they can prove they had a reasonable vetting process.  Large fines for renting an apartment to an illegal alien.\nWhy do I, an American citizen need 3 forms of ID to get a job and these illegal aliens don’t need of any of this?  It’s infuriating.",
                      "datetime": "June 11, 2025 10:51 am",
                      "vote_up": 42,
                      "vote_down": 0,
                      "reply_to": "461165",
                      "responses": [
                        {
                          "id": "461186",
                          "author": "Compsci",
                          "comment": "Fines mean nothing because the company pays the fine.  One needs to break the veil of corporate immunity is such cases and send offenders who make such decisions—and their superiors—to jail!  That will change the situation over night.  No different that breaking “qualified immunity” for police officers, which is now a growing trend.\nThere are many such examples outside of the Western world wrt to the above.  Say what you will about China, but a bullet in the head in front of a packed stadium for economic “crimes” always seems refreshing to me.  Quick and final.",
                          "datetime": "June 11, 2025 11:10 am",
                          "vote_up": 24,
                          "vote_down": 0,
                          "reply_to": "461174",
                          "responses": [
                            {
                              "id": "461214",
                              "author": "Jeffrey Zoar",
                              "comment": "We should end qualified immunity for politicians before we end it for cops",
                              "datetime": "June 11, 2025 11:56 am",
                              "vote_up": 12,
                              "vote_down": 0,
                              "reply_to": "461186",
                              "responses": [
                                {
                                  "id": "461249",
                                  "author": "Compsci",
                                  "comment": "Qualified immunity disqualification for cops has primarily been restricted to infractions of civil rights.  I’ll leave it at that.",
                                  "datetime": "June 11, 2025 12:59 pm",
                                  "vote_up": 1,
                                  "vote_down": 0,
                                  "reply_to": "461214",
                                  "responses": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "461241",
                      "author": "TempoNick",
                      "comment": "I’ve got a good example for you: Melania Trump. She brought her parents and her sister over. Are you telling me that she shouldn’t have that support system around? That she should just sit all alone in her lonely penthouse with her autistic kid and with Trump living in separate quarters running around grabbing other women by the pcvssy? That her only connection to humanity should be the ugly family she married into?Ugly maybe strong to use against the Trumps, but I don’t get the warm and fuzzies with any of them. Imagine being all alone and stuck with all that around you. Anybody would go crazy.",
                      "datetime": "June 11, 2025 12:39 pm",
                      "vote_up": 0,
                      "vote_down": -29,
                      "reply_to": "461165",
                      "responses": [
                        {
                          "id": "461266",
                          "author": "Mikew",
                          "comment": "Your arguments are feminine, emotional and irrational.  Know when to call it a day.",
                          "datetime": "June 11, 2025 2:02 pm",
                          "vote_up": 17,
                          "vote_down": 0,
                          "reply_to": "461241",
                          "responses": [
                            {
                              "id": "461288",
                              "author": "TempoNick",
                              "comment": "My arguments are not feminized at all. I’m just a big believer in family and that includes extended family. I like having my people around me. “Friends” are a dime a dozen.We recently had a memorial lunch for my aunt. 75 people there. Family, extended family, friends, people we know from church. Or are you jealous that we have it and you don’t?In a different time and day, my aunt’s grandfather died in an industrial accident and is buried in Weirton, West Virginia. They didn’t even put a marker on his grave and the records burned in a cemetery fire so they don’t even know where his grave is. That was life then, thrown to the wolves.And nobody has answered my question on Melania. I guess she should just fend for herself, too? I guess she can go to some woman’s shelter if she gets tired of orange man grabbing other women’s pvssies?😆😆😆",
                              "datetime": "June 11, 2025 3:42 pm",
                              "vote_up": 0,
                              "vote_down": -17,
                              "reply_to": "461266",
                              "responses": [
                                {
                                  "id": "461374",
                                  "author": "Compsci",
                                  "comment": "I might add, you lack self-awareness and are a narcissist.  You cannot make your point and move on.  You must continue to have the last word in all commentary—even when it falls on deaf ears.",
                                  "datetime": "June 12, 2025 9:19 am",
                                  "vote_up": 3,
                                  "vote_down": 0,
                                  "reply_to": "461288",
                                  "responses": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "461273",
                          "author": "Tars Tarkas",
                          "comment": "They can always go home!!!  That would solve all of these problems. Just GTFO of my country!!!  PROBLEMS SOLVED!",
                          "datetime": "June 11, 2025 2:35 pm",
                          "vote_up": 13,
                          "vote_down": 0,
                          "reply_to": "461241",
                          "responses": [
                            {
                              "id": "461297",
                              "author": "TempoNick",
                              "comment": "You’re overestimating the greatness of this country as a place to live. It isn’t 1956 anymore. You’ve swallowed the propaganda.",
                              "datetime": "June 11, 2025 4:58 pm",
                              "vote_up": 0,
                              "vote_down": -15,
                              "reply_to": "461273",
                              "responses": [
                                {
                                  "id": "461319",
                                  "author": "CorkyAgain",
                                  "comment": "Yeah, and what about the country has changed since 1956?\nIts demographics.",
                                  "datetime": "June 11, 2025 7:20 pm",
                                  "vote_up": 10,
                                  "vote_down": 0,
                                  "reply_to": "461297",
                                  "responses": []
                                },
                                {
                                  "id": "461560",
                                  "author": "Luther's Turd",
                                  "comment": "I’ll take 1956, please!\nLuther’s Turd",
                                  "datetime": "June 12, 2025 9:12 pm",
                                  "vote_up": 0,
                                  "vote_down": 0,
                                  "reply_to": "461297",
                                  "responses": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "461299",
                          "author": "Ed",
                          "comment": "Maybe you haven’t been paying attention but Barron Trump is an alpha male.",
                          "datetime": "June 11, 2025 5:14 pm",
                          "vote_up": 6,
                          "vote_down": 0,
                          "reply_to": "461241",
                          "responses": [
                            {
                              "id": "461321",
                              "author": "ray",
                              "comment": "It would be lovely to hope so.\nA member of the financial elite who is hip to the Civil Rights Ruination would be a huge asset.  A based Barron could make waves.",
                              "datetime": "June 11, 2025 7:33 pm",
                              "vote_up": 1,
                              "vote_down": 0,
                              "reply_to": "461299",
                              "responses": []
                            }
                          ]
                        },
                        {
                          "id": "461372",
                          "author": "Compsci",
                          "comment": "Another fallacy of logical argument.  You take a case of “one” and extend it to all. Yes, even Trump’s wife should not be allowed to bring her family over.  It’s the good of the whole over the good of the few.\nAgain emotion drives you, not reason.  Emotional arguments fall on deaf ears here.  Grow up.",
                          "datetime": "June 12, 2025 9:16 am",
                          "vote_up": 2,
                          "vote_down": 0,
                          "reply_to": "461241",
                          "responses": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "461216",
                  "author": "Alzaebo",
                  "comment": "Party like it’s 1924.  We’ve done this before.  40 years of immigration brought riots last time, in the 40 years that followed we got a lot of nation-building done.",
                  "datetime": "June 11, 2025 12:00 pm",
                  "vote_up": 8,
                  "vote_down": 0,
                  "reply_to": "461127",
                  "responses": [
                    {
                      "id": "461251",
                      "author": "Compsci",
                      "comment": "Yeah, but the crowd was from Europe—not third world crap holes of minimal IQ and culturally backward people.  Nation building is not a given with the present stock.",
                      "datetime": "June 11, 2025 1:01 pm",
                      "vote_up": 9,
                      "vote_down": 0,
                      "reply_to": "461216",
                      "responses": [
                        {
                          "id": "461289",
                          "author": "TempoNick",
                          "comment": "And that goes back to what I’m saying. If you’re selective up front, there’s nothing wrong with people bringing over their relatives to live a better life. You’re afraid that bringing your relatives over means we get flooded with third worlders. If you don’t bring those third worlders in the first place, there’s nothing to worry about.",
                          "datetime": "June 11, 2025 3:48 pm",
                          "vote_up": 0,
                          "vote_down": -14,
                          "reply_to": "461251",
                          "responses": [
                            {
                              "id": "461379",
                              "author": "Compsci",
                              "comment": "You argue from a position that does not exist, nor is practical to implement.  Give it up.  But even if, you import only Whites, you still have to have a vetting process for such a race.  Half the Whites in this country are on the left side of the Bell Curve.   Those in the bottom are worthless as well.  Just because they have a relative here—who indeed thrives—means nothing.",
                              "datetime": "June 12, 2025 9:23 am",
                              "vote_up": 0,
                              "vote_down": 0,
                              "reply_to": "461289",
                              "responses": []
                            },
                            {
                              "id": "461410",
                              "author": "Alzaebo",
                              "comment": "You’ve got to be Czech or Romanian.  The Romanian told me he took his family on a small picnic- that meant 3 station wagons with 25 relatives.",
                              "datetime": "June 12, 2025 10:00 am",
                              "vote_up": 0,
                              "vote_down": 0,
                              "reply_to": "461289",
                              "responses": []
                            }
                          ]
                        },
                        {
                          "id": "461408",
                          "author": "Alzaebo",
                          "comment": "That’s what I was saying, Compsci.  40 years of white immigration, following 1924, was 40 years of building.",
                          "datetime": "June 12, 2025 9:58 am",
                          "vote_up": 0,
                          "vote_down": 0,
                          "reply_to": "461251",
                          "responses": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "461147",
              "author": "Mycale",
              "comment": "Is India not the third world?",
              "datetime": "June 11, 2025 9:51 am",
              "vote_up": 13,
              "vote_down": 0,
              "reply_to": "461111",
              "responses": [
                {
                  "id": "461187",
                  "author": "Compsci",
                  "comment": "India is third world in the aggregate, but is really many people and subcultures.  Hence the conundrum we face in discussing them.",
                  "datetime": "June 11, 2025 11:12 am",
                  "vote_up": 2,
                  "vote_down": 0,
                  "reply_to": "461147",
                  "responses": [
                    {
                      "id": "461212",
                      "author": "george 1",
                      "comment": "Well I favor lumping them all together and deporting/excluding them without any discrimination.",
                      "datetime": "June 11, 2025 11:51 am",
                      "vote_up": 26,
                      "vote_down": 0,
                      "reply_to": "461187",
                      "responses": [
                        {
                          "id": "461271",
                          "author": "Dutchboy",
                          "comment": "It’s really very simple. We can’t properly employ and educate the people we have. We should not be importing any more. The best prospects for immigration are white Europeans but they are needed badly in their own countries.",
                          "datetime": "June 11, 2025 2:29 pm",
                          "vote_up": 9,
                          "vote_down": 0,
                          "reply_to": "461212",
                          "responses": []
                        }
                      ]
                    },
                    {
                      "id": "461224",
                      "author": "Alzaebo",
                      "comment": "Heh. Imagine us dumping our trash in their yards. How many conquistadors were guys out of prison?\nAnswer: a lot.They had two options: Go forth or hang.\nThe immivaders are the same.  They are conquistadors.",
                      "datetime": "June 11, 2025 12:17 pm",
                      "vote_up": 6,
                      "vote_down": 0,
                      "reply_to": "461187",
                      "responses": []
                    },
                    {
                      "id": "461229",
                      "author": "ray",
                      "comment": "I got no conundrum.  Their country is a shithole unless you’re super wealthy.  Third world for purposes of entry.",
                      "datetime": "June 11, 2025 12:24 pm",
                      "vote_up": 7,
                      "vote_down": 0,
                      "reply_to": "461187",
                      "responses": [
                        {
                          "id": "461252",
                          "author": "Compsci",
                          "comment": "That’s fine.  The conundrum sets in when you assume a country with an average IQ of 83 is on par with others of such ilk.  Then it becomes difficult to address the observation of a country that has designed and produced its own jet fighter, has nukes, etc, etc.",
                          "datetime": "June 11, 2025 1:04 pm",
                          "vote_up": 0,
                          "vote_down": 0,
                          "reply_to": "461229",
                          "responses": [
                            {
                              "id": "461305",
                              "author": "ray",
                              "comment": "I don’t recall making that assumption.",
                              "datetime": "June 11, 2025 5:27 pm",
                              "vote_up": 1,
                              "vote_down": 0,
                              "reply_to": "461252",
                              "responses": [
                                {
                                  "id": "461382",
                                  "author": "Compsci",
                                  "comment": "Ray, the comment has nothing to do specifically with you.  It is an observation with support to back it up—if challenged.",
                                  "datetime": "June 12, 2025 9:25 am",
                                  "vote_up": 0,
                                  "vote_down": 0,
                                  "reply_to": "461305",
                                  "responses": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "461191",
              "author": "RVIDXR",
              "comment": "On a personal selfish level I agree but from an optics standpoint if given the chance I’d replace every latino with a turban wearing jeet.\nThere’s no religious angle to shill for poopoo pagans as being just like us & jeets are so aggressively insufferable &  brazenly tribal it makes a much stronger case for immigration reform for normies.",
              "datetime": "June 11, 2025 11:16 am",
              "vote_up": 5,
              "vote_down": 0,
              "reply_to": "461111",
              "responses": [
                {
                  "id": "461225",
                  "author": "Alzaebo",
                  "comment": "Being overly clever just dumps a worse problem in our kids’ lap.Remember, we ain’t getting rid of them all.  That’s how history has happened since time immemorial.",
                  "datetime": "June 11, 2025 12:20 pm",
                  "vote_up": 5,
                  "vote_down": 0,
                  "reply_to": "461191",
                  "responses": [
                    {
                      "id": "461281",
                      "author": "RVIDXR",
                      "comment": "“clever”I did not claim they were clever, I do not believe they are clever & I’m not seeing how its better to have a much less hated brown race around in the country or how the fact they can’t all be removed makes that argument self evidently true on its face.My counter to that implication is jews who are able to blend in very well with Whites. On a scale of racial camouflage via perceived similarities, setting aside White liberals, jews are arguably the most concealed & jeets are on the complete opposite end of that spectrum in every conceivable way.It seems to me you’re implicitly arguing that higher racial concealment is better. I don’t know how else to take what you said so that’s what I’m responding to just to be clear.I prefer my racial enemies to be as visible & openly unpleasant as possible because it makes friend/enemy distinction easier & thus subversion harder by equal measure. So I disagree, I see no upside & even prefer they stay in their own ghettos if they’re going to be around rather than blur the lines & intermix with Whites in every way imaginable the way so many spics do.",
                      "datetime": "June 11, 2025 3:31 pm",
                      "vote_up": 1,
                      "vote_down": 0,
                      "reply_to": "461225",
                      "responses": [
                        {
                          "id": "461416",
                          "author": "Alzaebo",
                          "comment": "You do have a point there.",
                          "datetime": "June 12, 2025 10:04 am",
                          "vote_up": 0,
                          "vote_down": 0,
                          "reply_to": "461281",
                          "responses": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "461117",
          "author": "Jack Dodson",
          "comment": "The call to ban Third World migration was the logical next step after the totally symbolic grant of citizenship to white South Africans. I’m quite impressed as to how all of this has been carefully coordinated since the first day.",
          "datetime": "June 11, 2025 8:56 am",
          "vote_up": 18,
          "vote_down": 0,
          "reply_to": "461107",
          "responses": [
            {
              "id": "461125",
              "author": "Citizen of a Silly Country",
              "comment": "Yeah, the fact that a bunch of recently converted DR influencers (Walsh, Kirk, etc.) called for it all at once says something is going on behind the scenes. Regardless, this is a very good step in the right direction.\nIt’s not a huge leap from banning 3rd world immigration to all immigration or putting any country – India – on the banned list.",
              "datetime": "June 11, 2025 9:11 am",
              "vote_up": 26,
              "vote_down": 0,
              "reply_to": "461117",
              "responses": [
                {
                  "id": "461132",
                  "author": "Jack Dodson",
                  "comment": "Your concern about the Subcons is fully justified. The upper castes are highly intelligent. And we’ve seen the destruction a smart minority can cause.\nI don’t know if this is leading to a full moratorium but it would not surprise me. Whatever the end game, this is shockingly coordinated for something from the putative Right.",
                  "datetime": "June 11, 2025 9:22 am",
                  "vote_up": 19,
                  "vote_down": 0,
                  "reply_to": "461125",
                  "responses": [
                    {
                      "id": "461190",
                      "author": "Compsci",
                      "comment": "“And we’ve seen the destruction a smart minority can cause.”\nThe essence of the problem is not simply being a “smart minority”, it’s being a smart and “ethnocentric” minority.  That’s the problem we (Whites) have.  We are not ethnocentric enough to promote our own interests in this multiracial society.",
                      "datetime": "June 11, 2025 11:15 am",
                      "vote_up": 19,
                      "vote_down": 0,
                      "reply_to": "461132",
                      "responses": [
                        {
                          "id": "461233",
                          "author": "Paintersforms",
                          "comment": "This discussion has me thinking. I can’t speak to the lack (or not) of ethnocentricity of Europeans, but as for Americans, there’s the idea of leaving and starting over and nation building. We lack ethnocentricity because we’re building our ethnicity.Hence the hoopla about our Constitution— the law binds us together until we build stronger bonds.The process has been undermined, lately even demonized— those satanic Americans!(Undermined from the beginning by the presence of African slaves imo.)I’m over it. In the long run, I expect this to be a major transition point along the way to the American nation. But that will take honesty about what we’re working on",
                          "datetime": "June 11, 2025 12:29 pm",
                          "vote_up": 4,
                          "vote_down": 0,
                          "reply_to": "461190",
                          "responses": [
                            {
                              "id": "461261",
                              "author": "CorkyAgain",
                              "comment": "Well, as for me, I’m not interested in building a new ethnicity. If your ancestors weren’t northwest Europeans you’re alien to me.\nSorry, those of you who hail from Mediterranean or Slavic stock. Your behavior is infinitely more tolerable than the third worlders’ but I’ve never felt much kinship with you either. That’s just the way it is.\nThe “melting pot” never was.",
                              "datetime": "June 11, 2025 1:31 pm",
                              "vote_up": 2,
                              "vote_down": 0,
                              "reply_to": "461233",
                              "responses": [
                                {
                                  "id": "461312",
                                  "author": "Paintersforms",
                                  "comment": "Well then I’m not alien lol. But we aren’t NW Europeans. Drop me over there,I’m sure it feels familiar, but I’m sure it wouldn’t feel like home. I mean, part of the cause of revolution was the colonists coming to see themselves as Americans instead of British subjects. Just kind of happens with time and distance.",
                                  "datetime": "June 11, 2025 6:17 pm",
                                  "vote_up": 1,
                                  "vote_down": 0,
                                  "reply_to": "461261",
                                  "responses": [
                                    {
                                      "id": "461320",
                                      "author": "CorkyAgain",
                                      "comment": "It certainly wouldn’t feel like home now, since they’ve had a similar immigration problem which has ruined just about everything which made it what it once was.",
                                      "datetime": "June 11, 2025 7:26 pm",
                                      "vote_up": 4,
                                      "vote_down": 0,
                                      "reply_to": "461312",
                                      "responses": []
                                    }
                                  ]
                                },
                                {
                                  "id": "461317",
                                  "author": "TempoNick",
                                  "comment": "Too late. The proprietor of this blog said he’s rushing. I guess he has to go too. 😂",
                                  "datetime": "June 11, 2025 7:15 pm",
                                  "vote_up": 1,
                                  "vote_down": 0,
                                  "reply_to": "461261",
                                  "responses": [
                                    {
                                      "id": "461327",
                                      "author": "CorkyAgain",
                                      "comment": "You mean Russian?Look, I didn’t say the Mediterraneans and Slavics have to go anywhere.I get along with them just fine, and even admire them in many ways. We have a live and let live attitude toward each other that I find perfectly acceptable.  I just don’t resonate with them as much as I do with people with similar ancestry as my own.They’re distant relations at best and finding common ground with them requires abstracting away from each of our traditional cultures.  Less so than with blacks, Asians, or Indians from Mexico, of course, but I’d rather not do it all — especially since Germanic heritage is particularly under attack in today’s world.",
                                      "datetime": "June 11, 2025 10:07 pm",
                                      "vote_up": 3,
                                      "vote_down": 0,
                                      "reply_to": "461317",
                                      "responses": []
                                    },
                                    {
                                      "id": "461330",
                                      "author": "TempoNick",
                                      "comment": "^^^ Russian. (Didn’t catch it in time.)",
                                      "datetime": "June 12, 2025 12:20 am",
                                      "vote_up": 0,
                                      "vote_down": -1,
                                      "reply_to": "461317",
                                      "responses": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "461231",
                      "author": "ray",
                      "comment": "A bullet to the head is a persuasive thing.",
                      "datetime": "June 11, 2025 12:26 pm",
                      "vote_up": 2,
                      "vote_down": 0,
                      "reply_to": "461132",
                      "responses": []
                    }
                  ]
                },
                {
                  "id": "461160",
                  "author": "NoName",
                  "comment": "Citizen of a Silly Country: “It’s not a huge leap from banning 3rd world immigration to all immigration or putting any country – India – on the banned list.”\nThere the Coup de Grace would be the classification of Israhell* as a “3rd World Country”.\n*To include Scarsdale, Manhattan, Rittenhouse, Broward County, etc etc etc…",
                  "datetime": "June 11, 2025 10:28 am",
                  "vote_up": 6,
                  "vote_down": 0,
                  "reply_to": "461125",
                  "responses": [
                    {
                      "id": "461307",
                      "author": "ray",
                      "comment": "Uh, ok Abdul.  Are you PLO or something? Everything in the world is not Israel.\nDo you ever make any other sort of comment? I mean, besides Israel and Jews?",
                      "datetime": "June 11, 2025 5:30 pm",
                      "vote_up": 0,
                      "vote_down": -1,
                      "reply_to": "461160",
                      "responses": [
                        {
                          "id": "461426",
                          "author": "Alzaebo",
                          "comment": "Holy shit. If you study deep Jewish tenet, they believe they are spiritual aliens from a higher plane, colonizers and lightbringers trapped in the gross, feminine, organic material plane where reproduction is by the inferior, painful, messy process of giving birth- thus the hatred of women.\nCombine that with the embedded rage at Aryan superiority, wherein the only way to harvest the power of Eve’s people is to take that bitch Eve as a sex slave…no wonder the “righteous” feel this world is a Hell to be “fixed”.",
                          "datetime": "June 12, 2025 10:13 am",
                          "vote_up": 0,
                          "vote_down": 0,
                          "reply_to": "461307",
                          "responses": []
                        }
                      ]
                    },
                    {
                      "id": "461326",
                      "author": "Chris",
                      "comment": "They ended up in Scarsdale because the residents of Bronxville wouldn’t allow them to move in there.",
                      "datetime": "June 11, 2025 8:51 pm",
                      "vote_up": 1,
                      "vote_down": 0,
                      "reply_to": "461160",
                      "responses": []
                    }
                  ]
                },
                {
                  "id": "461278",
                  "author": "Wiffle",
                  "comment": "I’ll take the whatever is going on there.",
                  "datetime": "June 11, 2025 3:18 pm",
                  "vote_up": 1,
                  "vote_down": 0,
                  "reply_to": "461125",
                  "responses": []
                }
              ]
            },
            {
              "id": "461601",
              "author": "Ostei Kozelskii",
              "comment": "Make America White Again",
              "datetime": "June 13, 2025 9:51 am",
              "vote_up": 0,
              "vote_down": 0,
              "reply_to": "461117",
              "responses": []
            }
          ]
        },
        {
          "id": "461141",
          "author": "Grant",
          "comment": "Correct. “Developing world” was a 20th century term. All of the countries thatcoulddevelophavedeveloped. You could have called Korea or Singapore thedevelopingworld credibly. Guess what? They’re 1st world countries now and behavior that is commonplace in India are not tolerated there. Singapore disciplines you forspittingin the street, much lessshi….you get the idea. Nobody should look at India and think it’s 1st world. They’ve had well over half a century to make the jump from 3rd world backwater to 1st world (something other nations did over the course of a handful of decades). Their skyscrapers were all built by Koreans. They’re militarily incapable of contesting Pakistan, which no sane person would ever describe as anything other than 3rd world. Their primary export is undesirable people (the hallmark of a 3rd world country). Tell everybody you meet about the designated defecation streets in India. It goes a long way.",
          "datetime": "June 11, 2025 9:44 am",
          "vote_up": 23,
          "vote_down": 0,
          "reply_to": "461107",
          "responses": [
            {
              "id": "461237",
              "author": "Alzaebo",
              "comment": "Meanwhile, once you get past the Yaqui savages in Baja (the Aztecs couldn’t either), you have ultra-modern hospitals, refineries, skyscrapers, and highways along with ancient archaeology right in downtown Mexico City. Mexico is not that far a cry away from being brown Europe.\nWhat’s missing in Mexico (and Europe) is the same thing missing here: a death penalty.",
              "datetime": "June 11, 2025 12:33 pm",
              "vote_up": 2,
              "vote_down": 0,
              "reply_to": "461141",
              "responses": [
                {
                  "id": "461308",
                  "author": "ray",
                  "comment": "Correct about the Aztecs being foiled northwards by the Yaqui.  Mebbe the Tarahumara were around then too?",
                  "datetime": "June 11, 2025 5:32 pm",
                  "vote_up": 1,
                  "vote_down": 0,
                  "reply_to": "461237",
                  "responses": []
                },
                {
                  "id": "461313",
                  "author": "Jeffrey Zoar",
                  "comment": "Mexico is not so different from other hispanic countries. Where negros have a talented tenth, for hispanics it’s more like a talented third. This supports a lot of good things. But that other 2/3 also exists, and always will, like their huge, sprawling slums.",
                  "datetime": "June 11, 2025 6:47 pm",
                  "vote_up": 6,
                  "vote_down": 0,
                  "reply_to": "461237",
                  "responses": []
                }
              ]
            },
            {
              "id": "461270",
              "author": "Dr_Mantis_Tobbogan_MD",
              "comment": "The Indians’ military procurement system is byzantine, to put it mildly. When they were buying new fighter planes, one of the competitors went out of production waiting for these bureaucrats to make up their minds.And they have a weird mixture of Russian, British and French aircraft (with a few of our transports and patrol planes sprinkled in for fun) that make maintaining their fleet a logistical nightmare.They also have delusions of grandeur when it comes to their aircraft industry. Their indigenous fighter aircraft needed LOTS of U.S. engineers to check and rewrite the control laws for the fly-by-wire system. The aircraft would’ve been a disaster if it even made it into the air without our help.The Pakistanis have an indigenous fighter aircraft that was mainly designed by the Chinese and simply assembled in Pakistan. It’s a far better airframe than the  HAL Tejas and has actually been exported to other countries. The Tejas is a bit of a white elephant.",
              "datetime": "June 11, 2025 2:23 pm",
              "vote_up": 8,
              "vote_down": 0,
              "reply_to": "461141",
              "responses": []
            }
          ]
        },
        {
          "id": "461209",
          "author": "george 1",
          "comment": "As well as certain dual citizens from a small country in the ME.",
          "datetime": "June 11, 2025 11:49 am",
          "vote_up": 8,
          "vote_down": 0,
          "reply_to": "461107",
          "responses": [
            {
              "id": "461432",
              "author": "Alzaebo",
              "comment": "It’s a developing country!",
              "datetime": "June 12, 2025 10:22 am",
              "vote_up": 0,
              "vote_down": 0,
              "reply_to": "461209",
              "responses": []
            }
          ]
        }
      ]
    },
    {
      "id": "461106",
      "author": "usNthem",
      "comment": "To see mewling queers like newsome or nigra girl bosses like bass basically championing these brown pieces of crap and/or blaming Trump for the chaos is so pathetic, it’s almost beyond belief.  Then top it off with the largely White sycophantic hollywood tards predictably on board – it’s a freaking bad look.  As I’ve said before, you just can’t hate these leftists and their slavering NPC drones enough…",
      "datetime": "June 11, 2025 8:41 am",
      "vote_up": 36,
      "vote_down": 0,
      "reply_to": null,
      "responses": [
        {
          "id": "461115",
          "author": "TempoNick",
          "comment": "Speaking of Hollywood, I was watching a little bit of Telemundo a few weeks ago. I don’t understand a thing they say, but I was captivated by all the good looking women on the screen. Better looking than what you see on American TV.\nThat’s not what we are getting with these illegals. We’re getting the not so attractive non-european stock. You would think that Hollywood would be sensitive to the uglification of America because it directly impacts whether that industry gets to thrive or not.\nFilling this country with ugly women will result in Hollywood going down the tubes.",
          "datetime": "June 11, 2025 8:55 am",
          "vote_up": 7,
          "vote_down": 0,
          "reply_to": "461106",
          "responses": [
            {
              "id": "461121",
              "author": "Wolf Barney",
              "comment": "Speaking of Telemundo, who have always been on the side of the invaders, I just watched a video showing their van getting destroyed by the rioters.",
              "datetime": "June 11, 2025 9:05 am",
              "vote_up": 33,
              "vote_down": 0,
              "reply_to": "461115",
              "responses": []
            },
            {
              "id": "461122",
              "author": "Jack Dodson",
              "comment": "Hollywood is circling the drain for the most part. “Hollywood” as a term actually is archaic. For the most part, creatives have been leaving right along with everyone else, entire sectors of the film industry are no longer in California, and there is vastly diminished demand for the product.",
              "datetime": "June 11, 2025 9:06 am",
              "vote_up": 24,
              "vote_down": 0,
              "reply_to": "461115",
              "responses": [
                {
                  "id": "461149",
                  "author": "Grant",
                  "comment": "Due to union laws, almost nobody is filming in the lots anymore. I was watching an interview with Jim Agnew and other industry types talking about how Hollywood is turning into Detroit. You have to pay union people to be present for anything. Canada has always had generous grants to film there (ever wonder why 97% of every planet SG1 ever visited looked like British Columbia) and other areas are picking this up. People mentioned it’s cheaper to fly everybody and everything out to Ireland and film there rather than use closed sound stages in Burbank. Good riddance. I just wish the Hollywood mindset would die with the location. Indie video games and music have been annihilating their “AAA” competitors, but indie films (if they’re not simple low-budget affairs) are difficult to make. You’re not going to get a great action film with car chases and explosions without decent funding, whether it’s practical effects or CGI. AI might change some of that with CGI.",
                  "datetime": "June 11, 2025 9:53 am",
                  "vote_up": 12,
                  "vote_down": 0,
                  "reply_to": "461122",
                  "responses": [
                    {
                      "id": "461168",
                      "author": "Compsci",
                      "comment": "Hence Trump’s reference to Hollywood movies being subject to tariffs.",
                      "datetime": "June 11, 2025 10:41 am",
                      "vote_up": 4,
                      "vote_down": 0,
                      "reply_to": "461149",
                      "responses": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "461153",
              "author": "Montefrío",
              "comment": "I was watching a little bit of Telemundo a few weeks ago. I don’t understand a thing they say, but I was captivated by all the good looking women on the screen.I’ve been living in Argentina for 21 years (not exactly Telemundo-land, but Spanish-speaking) and those women aren’t just on the screen: they’re everywhere. My son (now also my neighbor) married one, a just-turned-23 biochem grad who’d been the leader of acarnavalsamba team that’s perhaps the best-known in the country. She’s a mix of Spanish, Arab and Guaraní from a working-class background, but nobody’s fool. Promptly popped out three grandchildren, little gringos all and I sit on the front porch watchin’ with a grin of serene content.",
              "datetime": "June 11, 2025 10:08 am",
              "vote_up": 16,
              "vote_down": 0,
              "reply_to": "461115",
              "responses": [
                {
                  "id": "461244",
                  "author": "ray",
                  "comment": "They got hot females in C.R. too, and they appear to like old gringos.\nLiving in Lat. Am. is like getting released from prison.",
                  "datetime": "June 11, 2025 12:49 pm",
                  "vote_up": 6,
                  "vote_down": 0,
                  "reply_to": "461153",
                  "responses": []
                },
                {
                  "id": "461334",
                  "author": "Bloated Boomer",
                  "comment": "She doesn’t sound very white.",
                  "datetime": "June 12, 2025 6:01 am",
                  "vote_up": 1,
                  "vote_down": 0,
                  "reply_to": "461153",
                  "responses": []
                }
              ]
            },
            {
              "id": "461185",
              "author": "RealityRules",
              "comment": "Are all the male telemprompter readers black like in post-American teleprompter reader transmission land?",
              "datetime": "June 11, 2025 11:10 am",
              "vote_up": 8,
              "vote_down": 0,
              "reply_to": "461115",
              "responses": []
            },
            {
              "id": "461199",
              "author": "Compsci",
              "comment": "What you’ve noted is the “sexism” and “patriarchy” of the South American culture. For as long as I can remember we’ve been regaled about our Southern “brothers” lack of wokeness, which is reflected in their culture. i.e., treatment of women. 😉\nI find such refreshing. Hell, there are even “news” programs where the “weather babe” strips. Here we have predominantly women as weather reporters, but pretend they are there for their superior “knowledge” rather than “eye candy”, but whichever, it seems they are never plain and ugly.",
              "datetime": "June 11, 2025 11:31 am",
              "vote_up": 9,
              "vote_down": 0,
              "reply_to": "461115",
              "responses": []
            },
            {
              "id": "461302",
              "author": "Ed",
              "comment": "Univision and Telemundo only put hot looking women of mostly European stock on the air. No way would they ever put someone of indigenous stock on the air. Same for their soap operas, known as novelas. You have to look very hard to find anyone that is ugly. For some reason, American TV commercials have forgotten that and are racing to find some of the most repulsive people in our nation.",
              "datetime": "June 11, 2025 5:19 pm",
              "vote_up": 7,
              "vote_down": 0,
              "reply_to": "461115",
              "responses": [
                {
                  "id": "461608",
                  "author": "Ostei Kozelskii",
                  "comment": "Actually, it’s the same with India. Their films and music videos are filled with beauteous Indo-Europeans, not muddy Dravidians.",
                  "datetime": "June 13, 2025 10:02 am",
                  "vote_up": 0,
                  "vote_down": 0,
                  "reply_to": "461302",
                  "responses": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "461157",
      "author": "Vizzini",
      "comment": "In the Twitter show ZMan mentions at the beginning of today’s post, they talk about an incident in Omaha where more than 100 illegals were arrested at a meat processing plant. When are we also going to arrest, jail and execute the ones who hired those illegals?",
      "datetime": "June 11, 2025 10:22 am",
      "vote_up": 32,
      "vote_down": 0,
      "reply_to": null,
      "responses": [
        {
          "id": "461215",
          "author": "Evil Sandmich",
          "comment": "The lefties on Twitter think they’re scoring points by asking why the employers aren’t being punished (well, I guess they are, just not the kind they think).",
          "datetime": "June 11, 2025 11:58 am",
          "vote_up": 4,
          "vote_down": 0,
          "reply_to": "461157",
          "responses": []
        },
        {
          "id": "461236",
          "author": "3g4me",
          "comment": "When is Trump going to arrest all the illegals in Postville, Iowa brought in by ShlomoRubashkin and company?  Oh wait . . . Zion Don.",
          "datetime": "June 11, 2025 12:32 pm",
          "vote_up": 12,
          "vote_down": 0,
          "reply_to": "461157",
          "responses": []
        }
      ]
    },
    {
      "id": "461119",
      "author": "mmack",
      "comment": "One thing that has helped our side is two things that were present in 2020 aren’t present now:1) The hysterical lockdowns over COVID2) Twitter is now X, and is uninterested in “un-personing” people with non-Leftist viewpoints.People on X have reminded users the same Governor Hairgel that is decrying the Heavy Hand of Government enforcing laws in California put draconian laws in place around COVID enforcement and used the Heavy Hand of (State) Government to do things like arrest people surfing, paddleboarding, or just walking alone along the beach in CA. They also did astoundingly stupid things like filling in skate parks with tons of sand so they couldn’t be used.Further, with the addition of Community Notes X serves as a counter to the “Baghdad Bob-ism” of mainstream media who are trying the “Mostly Peaceful” angle on demonstrations. X users are countering the MSM’s dissimulation, in the style of cheaters being caught in flagrante delicto, of asking their viewers about X posts “Who you gonna believe, me or your lyin’ eyes Baby?”Frankly, as has been mentioned here repeatedly, I don’t know if it will “move the needle” for the great bulk of “normals”, but it could be a start.",
      "datetime": "June 11, 2025 8:59 am",
      "vote_up": 29,
      "vote_down": 0,
      "reply_to": null,
      "responses": [
        {
          "id": "461128",
          "author": "Jack Dodson",
          "comment": "Relatedly, people have tuned out the old-school propaganda organs, even if they do not use social media. Also, people under 40 realize there are no laws or justice outside of raw power at this point. I’ve never thought shy of economic collapse there would be a serious challenge to the system but that is not a given now.",
          "datetime": "June 11, 2025 9:15 am",
          "vote_up": 17,
          "vote_down": 0,
          "reply_to": "461119",
          "responses": []
        },
        {
          "id": "461196",
          "author": "Robbo",
          "comment": "People having a go at Musk – and he deserves a lot of criticism – forget how seminal a move it was his buying Twitter off that pathetic leftist dweeb, Dorsey.",
          "datetime": "June 11, 2025 11:22 am",
          "vote_up": 14,
          "vote_down": 0,
          "reply_to": "461119",
          "responses": [
            {
              "id": "461610",
              "author": "Ostei Kozelskii",
              "comment": "Now we understand why Leftists howled about it so shrilly.",
              "datetime": "June 13, 2025 10:07 am",
              "vote_up": 0,
              "vote_down": 0,
              "reply_to": "461196",
              "responses": []
            }
          ]
        },
        {
          "id": "461243",
          "author": "Alzaebo",
          "comment": "Governor Hairgel sent police into preschools because they didn’t enforce the mask mandate on 2 year-olds.\nThe MSM? South Central LA’s own Maxine Waters- that’s her district they are rioting in- was on yesterday literally saying don’t believe your lying eyes.",
          "datetime": "June 11, 2025 12:47 pm",
          "vote_up": 5,
          "vote_down": 0,
          "reply_to": "461119",
          "responses": [
            {
              "id": "461309",
              "author": "ray",
              "comment": "Mad Max has openly instigated violence and riots before.  Calling for it specifically from her power-perch.\nShe’s the kind you most need rid of.  Nothing but hate and malice in her face.",
              "datetime": "June 11, 2025 5:39 pm",
              "vote_up": 4,
              "vote_down": 0,
              "reply_to": "461243",
              "responses": [
                {
                  "id": "461611",
                  "author": "Ostei Kozelskii",
                  "comment": "She should have been greased long ago.",
                  "datetime": "June 13, 2025 10:08 am",
                  "vote_up": 0,
                  "vote_down": 0,
                  "reply_to": "461309",
                  "responses": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "461130",
      "author": "Mr. Invisible",
      "comment": "This can boomerang very fast on the Blobules. They themselves are — or at least, once were — familiar with human psychology. The same emotional dynamics that have led many Whites for the past 30-40-50 years to view themselves as somehow immoral — and others moral — are extremely fluid and subject to reversal at the drop of a hat (or flag). These are highly volatile, emotional, irrational people, looking for enemies to blame for perceived sins.For a long time, that impulse has been directed inward. The problem the Blob might have going forward is that fewer and fewer people have complex inner lives, which is the only entrance to the psychological path down the Stations of the Cross of guilt, shame, and self-recrimination, especially if one comes from a Christian background. These simpler types are less likely to accept accusations of ancestral abuses in order to extract something from them in the present, and to sacrifice something material as recompense for an abstruse and immaterial moral harm they themselves did not commit. After all, they too want to consume, and paying reparations and placing 10,000 foreigners in front of them in the line for a job will dawn on them as manifestly “unfair” (the word they are most likely to reach for), and an obstacle to the life being offered to them on social media and the “influencers” of their generation.Moreover, at some point, even the sinner recognizes that they have done their penance, and begins to ask,what else am I supposed to do? And it is at that point that they realize they are being manipulated against their own self-interests, and their inner emotional turmoil — which they believe they have addressed, seventy times seven — then begins to be projected outward. I suppose one can find examples of this in the 20th century.",
      "datetime": "June 11, 2025 9:18 am",
      "vote_up": 25,
      "vote_down": 0,
      "reply_to": null,
      "responses": [
        {
          "id": "461138",
          "author": "Jack Dodson",
          "comment": "Well done. I expect the Blobules to use raw force and violence if/when they realize their dominance is slipping. As you write, they are estrogen-drenched shipwrecks and cannot help but lash out. I actually think that will provide a pretext to go after them and it will happen. How will that turn out? Dunno. But what is being done to them is well-choreographed–shockingly so–and every time they get back on their feet they get knocked back down. It is pleasantly surprising. Just as younger whites are inherently opposed to Zion, they also realize only raw force works and rules and laws are a joke.",
          "datetime": "June 11, 2025 9:33 am",
          "vote_up": 23,
          "vote_down": 0,
          "reply_to": "461130",
          "responses": []
        },
        {
          "id": "461139",
          "author": "Grant",
          "comment": "I’ve said it before: one of the worst mistakes the blob ever made was messing with the “bread and circuses.” There are a lot of funny memes that correctly point to the fact that one of the key elements of the 2016 Trump campaign was its online presence and one of the key elements behind the online presence was “gamergate” where white men were enraged at the amount of social justice warrior manipulation in the gaming industry. Entertainment has continued to get worse. People no longer have a fantasy world to escape to and are forced to live in the grim reality. Fast food is now prohibitively expensive for most people (they shouldn’t be eating it anyways, but cheap slop and beer are the “bread” in the B&C component). If the blob was competent in any way, they would have locked the DEI crowd out of entertainment and subsidized slop so it stayed cheap.",
          "datetime": "June 11, 2025 9:35 am",
          "vote_up": 25,
          "vote_down": 0,
          "reply_to": "461130",
          "responses": [
            {
              "id": "461146",
              "author": "Wolf Barney",
              "comment": "Great point. Sports and entertainment was useful in keeping our eyes off the War against Whites until it was decided to black, black, blackety-black all of the movies, TV, commericials and place scolding END RACISM messages on football field and helmets.",
              "datetime": "June 11, 2025 9:51 am",
              "vote_up": 27,
              "vote_down": 0,
              "reply_to": "461139",
              "responses": []
            },
            {
              "id": "461240",
              "author": "ray",
              "comment": "Very sharp. The Woke-Fem Politburo always oversteps, because it is a feature of their pseudo-religious zealotry.\nAnd the Woke-Fem Politburo relies on brute force (LE and the courts) and the bullying of all opposition. GamerGate was a perfect example: they assumed they would overrun the opposition and simply take whatever they wanted, as they’ve done with all other institutions.\nBut the ‘incels’ (the gynarchy loves that derogation) stood their ground and resisted the Borg. The only ones who have done so successfully so far.",
              "datetime": "June 11, 2025 12:39 pm",
              "vote_up": 10,
              "vote_down": 0,
              "reply_to": "461139",
              "responses": []
            }
          ]
        }
      ]
    },
    {
      "id": "461101",
      "author": "TempoNick",
      "comment": "Legume riots. LOL. I was about halfway through the article before it finally hit me what you were talking about. LOL.",
      "datetime": "June 11, 2025 8:34 am",
      "vote_up": 25,
      "vote_down": 0,
      "reply_to": null,
      "responses": [
        {
          "id": "461102",
          "author": "TempoNick",
          "comment": "Beaners! 😂😂😂😂😂😂",
          "datetime": "June 11, 2025 8:35 am",
          "vote_up": 14,
          "vote_down": 0,
          "reply_to": "461101",
          "responses": [
            {
              "id": "461142",
              "author": "Dr_Mantis_Tobbogan_MD",
              "comment": "",
              "datetime": "June 11, 2025 9:46 am",
              "vote_up": 7,
              "vote_down": 0,
              "reply_to": "461102",
              "responses": []
            }
          ]
        }
      ]
    },
    {
      "id": "461126",
      "author": "Jeffrey Zoar",
      "comment": "This latest “revolution” looks like weak sauce to me. Not impressed. Media hysteria tries but fails to elevate it to the level of past civil unrest in AINO. Maybe we will get a fake crackdown to put down the fake revolution, all for the optics.Because it just doesn’t stir up the negros. Sure they will go for some free nikes when the opportunity presents, but for the most part this isn’t their show. They don’t like the flood of mestizos any better than anyone else. And the mestizos themselves, for the most part, are not all that interested in raising hell. Meanwhile the baizuo will hold their meaningless  “no kings” parades on the weekends and nobody will care. But it gives them something to do.The Zman didn’t mention the hand of Sheinbaum/cartels (same thing) in all of this. Or how the Trump admin will respond to that. I don’t know how they will. But they should.",
      "datetime": "June 11, 2025 9:12 am",
      "vote_up": 24,
      "vote_down": 0,
      "reply_to": null,
      "responses": [
        {
          "id": "461150",
          "author": "Mycale",
          "comment": "I listened to Auron MacIntyre’s podcast on this, and he pointed out that with the blacks sitting this one out, the Dems don’t get the holy blessing of their (2nd most) chosen people. As has often been pointed out, blacks and Hispanics have a lot of animosity. Illegal immigration hurts working class blacks first and foremost. Hispanics have pushed blacks out of many neighborhoods. The rise of Hispanics in the Dem coalition means a decreased status of blacks. Black leaders can see all this. They’re not going to go and march for their own political disenfranchisement. Of course, conservatives can’t see this because they need to pretend to be color blind. But Steve Sailer is right, this Dem coalition only holds together when everyone is targeting White people. You can’t paint this ridiculous protest as anything more than an unassimilated group of foreigners who do not want to live under this nation’s laws.",
          "datetime": "June 11, 2025 10:02 am",
          "vote_up": 22,
          "vote_down": 0,
          "reply_to": "461126",
          "responses": [
            {
              "id": "461155",
              "author": "Grant",
              "comment": "They specifically brought up Compton (or La Compa as it may as well be renamed). It’s been a talking point since at least 2013 that the Mecca of West Coast rap has turned into mariachi-land. We truly are watching the dogs fight over the scraps of our civilization. Unfortunately for blacks, Hispanics are slightly smarter and far more organized and don’t have any of the political handicaps that whites do. One needn’t wonder how blacks would have fared against the Comanches. You’re watching it in most major cities. The good news is that we know heritage Americans are capable of beating both the Indios (the plains wars) and the Mexicans (Texas Independence, Mexican American War) with relative ease if there’s political will to do so. The grandstanding of militant blacks that they could win a war against whites is comical considering they can’t even beat Hispanics.",
              "datetime": "June 11, 2025 10:19 am",
              "vote_up": 21,
              "vote_down": 0,
              "reply_to": "461150",
              "responses": []
            },
            {
              "id": "461167",
              "author": "Jeffrey Zoar",
              "comment": "Reading your post, I got this mental image of negros going out in the streets to confront the mestizos. I’ll have to put popcorn on my shopping list.",
              "datetime": "June 11, 2025 10:39 am",
              "vote_up": 2,
              "vote_down": 0,
              "reply_to": "461150",
              "responses": [
                {
                  "id": "461178",
                  "author": "Mycale",
                  "comment": "I think that gibs and a quick path to political power within the Democrat party are the only things that kept that from happening decades ago.",
                  "datetime": "June 11, 2025 11:00 am",
                  "vote_up": 3,
                  "vote_down": 0,
                  "reply_to": "461167",
                  "responses": []
                }
              ]
            },
            {
              "id": "461193",
              "author": "mmack",
              "comment": "As has often been pointed out, blacks and Hispanics have a lot of animosity.Keeping an eye on the news in Chicago from last year, the blacks in Chicago absolutely HATED having Mayor Conehead (Brandon Johnson) declare Chicago a “Sanctuary City”. This meant he settled plenty of border jumpers in traditionally black neighborhoods. I read and watched summaries of community meetings and the way black Chicagoans talked, you’d have thought it was a bunch of white Chicagoans from the 1960s or 70s (“These people come here and they bring crime and cause trouble! They don’t respect our community and their values are different than ours. They hang out and harass us!”).Of course, the main complaint was the immvaders were taking money that was rightfullytheirs.(Ol Brandon was pretty generous with The Gibs)So no, I don’t see blacks crying crocodile tears over Hispanics being deported.",
              "datetime": "June 11, 2025 11:18 am",
              "vote_up": 5,
              "vote_down": 0,
              "reply_to": "461150",
              "responses": []
            }
          ]
        },
        {
          "id": "461171",
          "author": "Compsci",
          "comment": "Trump has the upper hand on MX.  Their trade with us is overwhelming.  Any interference/diminishment will bankrupt MX.",
          "datetime": "June 11, 2025 10:48 am",
          "vote_up": 6,
          "vote_down": 0,
          "reply_to": "461126",
          "responses": []
        }
      ]
    },
    {
      "id": "461124",
      "author": "ray",
      "comment": "‘On the other hand, the Blob people are relentless. Like a drug-resistant virus, they must be completely eradicated to make sure they do not return’Yessir. Crushed with extreme pleasure and prejudice. And I am pleased if this is you presenting the ‘moderate man’ position.‘For example, whenever you see college aged white girls with whistles at one of these things, you know the army of not-for-profits has their people on the ground training protestors’As I’ve commented previously, hitting USAID was barely a beginning in eradicating the NGO Woke-Fem networks.But there was no follow-up from Le ‘Orange. You can’t take out one company or battalion and then expect you’ve won the war.Like most of America’s other problems, the Invader Issue will never be addressed as long as White Princesses with Whistles command the moral and ethical high ground of your nation . . . and call the shots on the streets and in the courtrooms. Everywhere, really.You must pulverize and disempower permanently the feral and predatory White Grrls who organize and lead all of these traitorous events and policies. The college-educated white chicks who have been waging war against Traditional America and Traditional Americans for a century now.Does Donald Trump have the stones for that? No. It’d be like imprisoning his own dotters. Donald is a yesterday man.You best find somebody with the stones for it while you still have a nation.",
      "datetime": "June 11, 2025 9:11 am",
      "vote_up": 24,
      "vote_down": 0,
      "reply_to": null,
      "responses": [
        {
          "id": "461133",
          "author": "Jack Dodson",
          "comment": "Trump is implementing a plan that has been crafted for him by others. The stones are on those who created it. I don’t know what the end game is, mind you, but so far so good.",
          "datetime": "June 11, 2025 9:24 am",
          "vote_up": 15,
          "vote_down": 0,
          "reply_to": "461124",
          "responses": [
            {
              "id": "461151",
              "author": "TempoNick",
              "comment": "I don’t even know if Trump is implementing the plan. I say he’s more of a non-executive chairman of the board. Trump and all of his appointees are just placeholders, actors for TV. Others are doing the real work. That’s what I have thought for a long time anyway.\nIt really is fascinating. This truly has the hallmarks of being a revolution. In a way, an Orange Revolution, except this time favorable to our interests. Too bad I’ll be dead before they do an Argo-style movie about it.",
              "datetime": "June 11, 2025 10:03 am",
              "vote_up": 0,
              "vote_down": 0,
              "reply_to": "461133",
              "responses": [
                {
                  "id": "461152",
                  "author": "Jack Dodson",
                  "comment": "Elected officials basically have no power at all as it is. But Trump is acting as a front man willingly here, which may be the worst nightmares of those in the Regime who tried to murder him. I like “Orange Revolution,” by the way, and will use it. This certainly is not a reaction as is what happens always with what passes for the Right here.",
                  "datetime": "June 11, 2025 10:07 am",
                  "vote_up": 6,
                  "vote_down": 0,
                  "reply_to": "461151",
                  "responses": [
                    {
                      "id": "461154",
                      "author": "TempoNick",
                      "comment": "Yeah, I made a funny even though I didn’t intend to. Orange revolution, LOL",
                      "datetime": "June 11, 2025 10:14 am",
                      "vote_up": 1,
                      "vote_down": 0,
                      "reply_to": "461152",
                      "responses": [
                        {
                          "id": "461259",
                          "author": "ray",
                          "comment": "It’s a good phrase, short and sticks.\nOrange Crush also would work.",
                          "datetime": "June 11, 2025 1:27 pm",
                          "vote_up": 3,
                          "vote_down": 0,
                          "reply_to": "461154",
                          "responses": []
                        }
                      ]
                    },
                    {
                      "id": "461156",
                      "author": "TempoNick",
                      "comment": "I really think it’s Steve Pieczenik and that crowd pulling the strings here. The movie Argo kind of touches at the edges of what’s going on here, that is what I have believed for a long time. I think just like they used Hollywood to pull the wool over the eyes of the government of Iran, they are using Hollywood to put their plan in effect.They are really doing the same thing that the subversives have done in the past, except what they are putting in place has popular support.I still go back to 2015, that was before Trump became president. Somebody held a gun to Google’s head to force them to change their name to Alphabet. (As in alphabet agencies.) Big corporations have no sense of humor. They would not be poking fun at themselves in that manner unless they were forced to.Likewise when Zero had to exit the back of the plane in China. I think we were under some form of military government and that was their way of sending a message that Zero had been removed.I wouldn’t bet my life on any of this, but countries like China don’t do such things to foreign leaders. Especially not to the President of the United States. Zero would not have been humiliated like that unless China was acting on a request by whoever was in power at the time.Those are kind of my thoughts on what is going on, but we shall see.",
                      "datetime": "June 11, 2025 10:20 am",
                      "vote_up": 1,
                      "vote_down": 0,
                      "reply_to": "461152",
                      "responses": []
                    }
                  ]
                },
                {
                  "id": "461198",
                  "author": "Robbo",
                  "comment": "As someone said above, the zeitgeist has changed and virtually overnight. One day, you’re strolling down the street in your afro and hot pants, feeling like the latest thing; the next, you’re wondering what the hell you were thinking of. Same with the Woke/DEI crap. It’s suddenly as hip as the Osmonds.",
                  "datetime": "June 11, 2025 11:26 am",
                  "vote_up": 8,
                  "vote_down": 0,
                  "reply_to": "461151",
                  "responses": []
                },
                {
                  "id": "461256",
                  "author": "Alzaebo",
                  "comment": "It also has the hallmark of manufacturing consent for a Palantir rollout.",
                  "datetime": "June 11, 2025 1:12 pm",
                  "vote_up": 3,
                  "vote_down": 0,
                  "reply_to": "461151",
                  "responses": []
                }
              ]
            },
            {
              "id": "461257",
              "author": "ray",
              "comment": "I see little evidence yet of stones. A raid on USAID and some rubber bullets at the latest Leftie riot barely scratches the surface.\nIf the NGOs are broken and their (white, female) bosses are imprisoned, that qualifies. Arrest Bass, Newscum, Maxine Waters, Pelosi and associated domestic insurgents, that definitely qualifies.\nSend monitors to every U.S. college accepting federal funds, and indict every person who continues to push gender and race quotas — qualifies.\nWhat’s transpired so far is in the right direction but . . . does not qualify.",
              "datetime": "June 11, 2025 1:13 pm",
              "vote_up": 3,
              "vote_down": 0,
              "reply_to": "461133",
              "responses": [
                {
                  "id": "461280",
                  "author": "Jack Dodson",
                  "comment": "I agree the NGO’s have to be destroyed root and branch. If I were doing this sequentially, it would be via the courts* and taxing authorities after they fly their freak flags. It seems, anyhow, to be moving in that direction. Based on my limited information, this is playing out that way. I’m happy so far.\n*There are judges in some jurisdictions who would do this; the Left has dominance but not a complete monopoly.",
                  "datetime": "June 11, 2025 3:29 pm",
                  "vote_up": 4,
                  "vote_down": 0,
                  "reply_to": "461257",
                  "responses": [
                    {
                      "id": "461322",
                      "author": "ray",
                      "comment": "Makes sense. I’d start with the NGOs and the colleges. The colleges manufacture the Woke and the Feminists, while the NGOs put into practice the satanic ideology they have learned.After that, move to the primary and secondary schools. Break the two major teachers’ unions, fire Ms. Teach by the millions, place (vetted) men in supervisory positions over ALL the public schools.The students must be de-programmed first, and I already know for a fact that millions of boys and young men would LOVE to purge the schools of the organized and official hatred of masculinity, whiteness and Christianity.The grrls?  They like things as they are.It can be done. Just takes wanna and some guts.",
                      "datetime": "June 11, 2025 7:48 pm",
                      "vote_up": 3,
                      "vote_down": 0,
                      "reply_to": "461280",
                      "responses": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "461253",
          "author": "Alzaebo",
          "comment": "Want to put the kibosh on Karen?Toss over the Civil Rights regime- she rode in on Affirmative Action, and feminists got rich by divorce lawyer reparations.",
          "datetime": "June 11, 2025 1:08 pm",
          "vote_up": 4,
          "vote_down": 0,
          "reply_to": "461124",
          "responses": [
            {
              "id": "461311",
              "author": "ray",
              "comment": "The Civil Rights Regime IS the Regime. That IS the Borg, the Establishment.  It must all be annihilated and soon.If you could visit major ‘family law’ (divorce) firms in the big cities of the nation, and discover the horrific, fat, screeching harpies that run those firms, you’d know why entering a ‘family law’ hearing is ruinous for males.Many of these sows have become mega-millionaires during the past 50 years of Rape the Male. Many courts now — civil and criminal included — openly practice ‘feminist jurisprudence’. Guess what happens if you are a man in their courtrooms?The shit I could tell you, wow. The Divorce Industry in Amerika is fully feminist, and fully malevolent. It is an alliance between women and the courts, a hugely remunerative alliance. LE is part of it too, the cowardly little fuckers.The Divorce Industry is demonic. It needs to be wiped out in total, period.",
              "datetime": "June 11, 2025 5:47 pm",
              "vote_up": 5,
              "vote_down": 0,
              "reply_to": "461253",
              "responses": []
            }
          ]
        }
      ]
    },
    {
      "id": "461137",
      "author": "Pickle Rick",
      "comment": "The entire zeitgeist has changed since the last riot season, as well as the BOM’s subordinates. This smells like a desperate throw of the dice in a war the Left is losing, knows it is losing, but can’t do anything else. Deploying (not “mobilizing”) the 2nd Battalion, 7th Marines (2/7) is a warning and a message to the political and judicial class. I think he’s hoping that some district Federal judge tries to order that he cannot deploy Marines as Commander in Chief to LA. He makes an example of LA and California, the beating heart of our enemies, or he is finished, and I think he knows it, or JD Vance and Pistol Pete Hegseth will tell him, because those two are unlike the Vichy worms he had in his first administration in Pence and “Lap Dog” Mattis.",
      "datetime": "June 11, 2025 9:32 am",
      "vote_up": 22,
      "vote_down": 0,
      "reply_to": null,
      "responses": [
        {
          "id": "461145",
          "author": "Jack Dodson",
          "comment": "I’ve thought the same about an attempt to provoke judicial overreach. A federal judge yesterday apparently was on the same page although that was just an early attempt to control the military from the bench. Given what we’ve seen, such a ruling is anticipated and probably welcomed.Bear in mind the Left suffers Victory Disease. They have not been seriously challenged in 80 years, and arguably twice that long. Their Achilles Heel always has been impulsivity, a feminine, estrogen-drenched hysteria when opposed, and it leads them to do stupid shit. Someone has coordinated and carefully crafted a brilliant challenge to the Old Regime and it anticipates this combination of complacency and impulsivity. I don’t know how it pans out, but it is shocking that what passes for the Right has brought a gun to a knife fight for once.Also, bear in mind this is the whole ball of wax. That makes the outcome existential for both factions.",
          "datetime": "June 11, 2025 9:49 am",
          "vote_up": 12,
          "vote_down": 0,
          "reply_to": "461137",
          "responses": [
            {
              "id": "461197",
              "author": "Robbo",
              "comment": "Part of the bigger battle is taking on and facing down the leftist judges. I hope Trump has the cojones for that.",
              "datetime": "June 11, 2025 11:24 am",
              "vote_up": 4,
              "vote_down": 0,
              "reply_to": "461145",
              "responses": [
                {
                  "id": "461282",
                  "author": "Jack Dodson",
                  "comment": "There likely is frenzied judge shopping.",
                  "datetime": "June 11, 2025 3:31 pm",
                  "vote_up": 1,
                  "vote_down": 0,
                  "reply_to": "461197",
                  "responses": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "461135",
      "author": "iForgotmyPen",
      "comment": "It will only be days before a random district judge rules that Trump can’t actually enforce any further immigration laws and blocks the insurrection act before it begins. This will come down to, yet again, whether Trump has the balls to start ignoring the courts and just start exercising raw executive power. His record to date suggests he will back down once told he can’t actually do presidential things because some immigrant judge tells him no.",
      "datetime": "June 11, 2025 9:29 am",
      "vote_up": 20,
      "vote_down": 0,
      "reply_to": null,
      "responses": []
    },
    {
      "id": "461109",
      "author": "Jack Dodson",
      "comment": "The question is whether the Trump Administration will take full advantage of the opportunities this failed sequel presents. My guess is they will, actually. I’m not totally convinced the oligarchs are primarily concerned about the empty cubicles, but there is no profit now in the mayhem and disorder, quite the opposite. Some of the Clouds’ advisors have taken out their calculators and realized–perhaps too late–that more than the Dirts would have to be strip-mined to finance the savages.A couple of related random thoughts on a few municipalities:Chicago will prove to be the killing ground. It is La Raza Central ruled by Negroes and is likely to devolve quickly into intra-ethnic savagery. Muh Holy Negro will be more on the receiving end than the White Devil. It will be a fight over who gets to rape any white girls with whistles in the inner city, among other things.D.C., the center of the Blob, also will have to be pacified later this summer. The political clowns will be forced to take kinetic action on their own turf after a point.Rioting in NYC will decide the upcoming mayoral race there. If Cuomo loses, and he very well may, the city will become Detroit East.",
      "datetime": "June 11, 2025 8:47 am",
      "vote_up": 20,
      "vote_down": 0,
      "reply_to": null,
      "responses": []
    },
    {
      "id": "461159",
      "author": "EggsX1",
      "comment": "Once the Biden people made an app that brought in multitudes of people on just the press of a button on a phone, that signaled the end of any legitimate immigration “process”.  There is effectively no difference between illegal and legal immigration and it all must be ended.",
      "datetime": "June 11, 2025 10:26 am",
      "vote_up": 12,
      "vote_down": 0,
      "reply_to": null,
      "responses": []
    },
    {
      "id": "461144",
      "author": "Mycale",
      "comment": "Well, we all knew that dismantling USAID was not going to be enough and they were going to find the money. Also, in hindsight, it seems like the media was egging on Trump by reporting on his low deportation numbers, trying to walk him into a trap. But then I saw CNN whining about how Trump’s favorability is skyrocketing right now, people aren’t ready to join in on another color revolution. We want these people out of the country, even normie Democrats.The revolutionaries might have overplayed thier hand. It doesn’t mean they are going to stop, of course, but unlike their 8 year buildup into the Summer of Floyd (where the groundwork was being laid in 2012), they rushed into this after the whole of America spent four years getting disgusted by what Mayorkas was bringing into this country.",
      "datetime": "June 11, 2025 9:49 am",
      "vote_up": 12,
      "vote_down": 0,
      "reply_to": null,
      "responses": []
    },
    {
      "id": "461118",
      "author": "Grant",
      "comment": "I’ve got a theory. Many people expected a lot of this color revolution stuff to die on the vine as USAID was gutted and the NGOs who received funding through this and went on to organize these clandestine actions as part of the marriage between elite bureaucratic and elite financial interests ran out. I was never that optimistic. Where’s the money coming from? I think it’s Europe. Their NGOs are still standing, even if they are used to receiving American tax dollarsGuys like Tom Luongo and Stormy Waters have pinpointed that the success of the European Elites relies on America First failing. They postulate that Europe is facing a sovereign debt default that will make Greece’s austerity in the 2000’s look like the roaring 20’s. The only way out was for Europe to siphon off heroic levels of capital from the US. Ursula von der Leyen (a criminal who happens to be president of the European Commission) has been at war with Jerome Powell over monetary policy for years. His predecessor, Yellen, had been giving Europe money hand over fist through interest rates and other policies. Europe needs to kill America First to resume business as usual. I’m willing to bet they’ve stepped up to continue funding the destabilizing organizations in the US to do what they do best. People will focus on the Walton family lending their support to the upcoming “No Kings” riots (a phrase they’ve been A-B testing since January on reddit and other places) or the gefilte-fish-taco-eating Mexican Gringotts goblina encouraging civil unrest across the US, but they’re small players and too inexperienced at these things. The most obvious answer is that the usual suspects are up to the usual mischief with some unusual funding. The blob abides.",
      "datetime": "June 11, 2025 8:56 am",
      "vote_up": 12,
      "vote_down": 0,
      "reply_to": null,
      "responses": [
        {
          "id": "461208",
          "author": "Hemid",
          "comment": "Europe’s money (for things like this) comes from us.Nobody likes this idea, but it explains some odd things, not least the bottomless budget and Republican politicians’ kowtowing (only Trump, out of the loop, dissents): Antifaet al.are a black branch of the US military.American antifa was started by a guy I know. Not a friend, obviously, but he was around. His freedom from concern, in every sense, caused some suspicion. The fantasycope, when needed, was that he was rogue intelligence, misspending his allowance to stick it to the man.Good cop.We should know by now, there’s no such thing.And nobody checked. Youcan’t, but nobody did. If you “followed the money,” the trail ended at this one guy.If you follow the money today, you get to Soros, some other Jews, unions’ political groups, the usual. You learn nothing.So instead, follow the chain ofobedience. Whosaysantifa can do what it does? Who says it’s an “idea” that can’t be resisted? Who says the enemy isyou?Commandsays.",
          "datetime": "June 11, 2025 11:49 am",
          "vote_up": 3,
          "vote_down": 0,
          "reply_to": "461118",
          "responses": []
        }
      ]
    },
    {
      "id": "461113",
      "author": "Marko",
      "comment": "If to the Blob, Democracy means invasion, then I support Democracy in Israel.",
      "datetime": "June 11, 2025 8:54 am",
      "vote_up": 12,
      "vote_down": 0,
      "reply_to": null,
      "responses": []
    },
    {
      "id": "461158",
      "author": "Tars Tarkas",
      "comment": "What the Trump admin needs to do is pursue RICO cases against all of the organization and finance behind antifa and la raza and any other organizations it can find including all of the “socialist” organizations and universities involved.\nDecades in fed prison for the people and confiscation of all the assets of these orgs. These are nothing but criminal organizations. The morons on the front lines in the streets are easily replaced, but the money and the organizations are much more vulnerable to lawfare and much harder to replace.",
      "datetime": "June 11, 2025 10:24 am",
      "vote_up": 11,
      "vote_down": 0,
      "reply_to": null,
      "responses": []
    },
    {
      "id": "461292",
      "author": "Alzaebo",
      "comment": "Let’s say Aztlan happens- that a Mexican or Latino government takes California and the Southwest. Kind of like Eastern Ukraine.\nIt will still have laws, and government; it may or may not be overly favorable to white people, even though Mexico has plenty of very light skinned folk.\nOne thing I’m willing to bet on is this: that it will in no way be as outright hostile to white people as our own govenment is.\nGood grief.  What if Aztlan ends up being where white refugees go?",
      "datetime": "June 11, 2025 4:03 pm",
      "vote_up": 9,
      "vote_down": 0,
      "reply_to": null,
      "responses": [
        {
          "id": "461314",
          "author": "Whiskey",
          "comment": "Whites and blacks are weirdly over-represented in California government circles. While the cops are mostly Latino. For example, Bass is not representative of of the city of LA’s demographics, and if NWA made a re-union album with surviving members it would be “Chased outta Compton.”Which brings the puzzling relative quite of Adam Schiff (the embodiment of Classy Freddy Blassie’s “Pencil Neck Geek”) and Alex Padilla, the two Senators, and putative candidate for Governor Katie Porker. As well as Kamala Harris. In normal circumstances its a severe hazard, the most dangerous place to be, between a politician and a news camera. Yet these people have been invisible or said the minimal. Meanwhile Bass and Newsom have several news conferences a day, as the leaders of the “Resistance.”So there seems to a be a split in California’s pols on the utility of fighting Trump for criminal illegals. Politics in California (inter-party that is) is brutal and those who lose like Villaraigosa, tend to lose big. Not much soft landing for them. Those who survive the Darwinistic struggle tend to be cruel, vicious, clever, and opportunistic. Note Harris to the best of my knowledge despite the Murdochs and the WSJ pouring money and publicity into her public relations efforts has said nothing. Some fear Steiner and the District Court Judges may not be coming.",
          "datetime": "June 11, 2025 6:49 pm",
          "vote_up": 6,
          "vote_down": 0,
          "reply_to": "461292",
          "responses": []
        },
        {
          "id": "461316",
          "author": "Whiskey",
          "comment": "Let me add my take on what is up with Mexicans in California, since I was born and raised here though spent time in other places. The majority of my life I have lived here.There is a separate, Mexican Spanish Universe for Mexicans in the US. It exists for those who migrated here as adults or near adults. Separate TV stations, radio stations, musical acts, comedians, lawyers, doctors, insurance companies, and more. A Mexican man can live his whole life here never speaking English and having what amounts to exported Mexico here. To a lesser extent, this is true of El Salvador, Guatemala, and Honduras. For whatever reason, I have never met a Costa Rican here in California, though I have elsewhere in the US.In this regard it is similar to the situation Louis Armstrong wrote about in his autobiography regarding blacks and Whites in New Orleans before desegregation. A black and White man can occupy the same streetcar, sidewalk, etc. but never ever acknowledge each other or even occupy the same social and mental universe. The same is true for Mexicans and other groups in Los Angeles and the greater metro area. For example, there are videos on YT entirely in Spanish, of Mexican guys in their Jeeps and other four wheelers going up some canyon in the snow (freak snow went fairly low).Mexicans are fairly left wing, they are not woke. They love big trucks, jeeps, barbecues, big lawns, etc. In that they are fairly red neck. Again, just my own personal observations make of it what you will.",
          "datetime": "June 11, 2025 7:01 pm",
          "vote_up": 10,
          "vote_down": 0,
          "reply_to": "461292",
          "responses": []
        }
      ]
    },
    {
      "id": "461184",
      "author": "RealityRules",
      "comment": "Great way to tie in yesterday’s post with today’s. A bunch of the smart people are smart enough to know, that the great singular genius meme is a myth. Elon isn’t designing and building these things. He could go away tomorrow and the talent and capital would still be there. Moreover, maybe somebody who is sane would direct those resources with far lower time preference and a real civilizational outlook. Of course, we have that type of world described for us by Guillame Faye who called it Archeofuturism. He didn’t flush it out enough, but the gist is there.These oligarchs are not the uber-mensch their fancy PR machines make them out to be. In fact, the megalomania and hype machines got their wealth far out over their skies and most of it accumulated from the future or by transferring from the analog world to the digital with arguably no real efficiency gain and ignoring the social costs.In other words, you took to get. This mob over here is calling for you. We played by the rules and then got shut out by DIE that you gleefully adopted. Coder jobs forever except for white men who can go suck it. Now there are no coder jobs forever, and that turned on a dime. All of their concern and humanitarian horse manure has turned out to be a gigantic lie. Then there is Karp – such a blatant psychopath. And again, the question smart people intuitively are answering is: Who needs you?We played by your rules but got played by you. LA and the flash looting of the past few years also gave us a glimpse of the efficacy of bots. The automated checkout counter is a joke. The Waymo car was a sitting duck. That isn’t to say that their tech can’t be formidable. But it can be sabotaged and the entire panoptican is dependent upon compliance – people being afraid of reputational damage and ostracization. But when you have nothing left to lose tens of millions of high agency smart people will just say, “I smile at your camera as I come for you. I played by the rules while you financially and spiritually supported an invasion of my lands and their conquest by a rabble of barely stone age hooligans.”A Merchant run order is not an order. It is a road to ruin. Ironically, the open society is just a lion laying down on his back to the jackals. It is easily gamed by the trickster. Well, now everyone can see, the rules were not rules but the erasure of rules. Given that, the people who always respected and honored the rules that were bent against them are starting to wonder if they should respect them at all.",
      "datetime": "June 11, 2025 11:07 am",
      "vote_up": 8,
      "vote_down": 0,
      "reply_to": null,
      "responses": []
    },
    {
      "id": "461112",
      "author": "Captain Willard",
      "comment": "Trump is lucky in that his enemies are inept. The Left Blob challenged him on issues – immigration/border, law/order – for which he has the most public support. Meanwhile, the ICE raids are ideal for Oligarchs – they keep their cheap labor meek and vulnerable while taking some pressure off strained state/local budgets. Oligarchs should be leaning into them while quietly thwarting e-Verify for employers and National ID etc. Instead they play into Trump’s strong hand. But this is just a warm-up for the real battle ahead, which Zman foreshadows, over AI. When AI replaces cubicle HR cat ladies and IT jeets, we’re going to see the Catfood and Curry Revolution.",
      "datetime": "June 11, 2025 8:52 am",
      "vote_up": 6,
      "vote_down": 0,
      "reply_to": null,
      "responses": [
        {
          "id": "461222",
          "author": "Hemid",
          "comment": "The cat ladies will be employed as the face of the chatbots that monitor and censor you—as they are now at, e.g., Google.Indians will be given job of maintaining the code at a point of constant almost total failure—as they are now at, e.g., X. (Whatever else it also was, Elon’s workforce reduction was a purge of white people. Notice the pictures he put out.)How many millions of jeet-hours per day are spent trying to force ads onto the screens of the tiny percentage of us who know how to block them? As theyinnovateand our percentage shrinks, their hours increase.The dream of “tech” is total inefficiency.Every dis-employed white man = a woman to watch over him (lest he become a “DVE”) and a jeet to assume his title. No one and nothing will replace what we do.“AI” doing our work is thead, not the product. People relish the idea. Conservatives especially do, imagining all of us “useless degree” guys getting ruined.lollmao",
          "datetime": "June 11, 2025 12:14 pm",
          "vote_up": 8,
          "vote_down": 0,
          "reply_to": "461112",
          "responses": [
            {
              "id": "461315",
              "author": "ray",
              "comment": "‘Every dis-employed white man = a woman to watch over him (lest he become a “DVE”) and a jeet to assume his title’The jeets have some work to do, but the women monitoring (and often judging) the white males they have displaced by ‘civil rights’ law? They are already in place, baby. And I do mean everywhere. It’s the Fem Nirvana.White men must turn their backs on Woke-Fem Amerika. Feminist women already are our teachers (indoctrinators), monitors, judges, and to a growing extent guards over our jail cells.At the county level, I’d estimate mebbe half of the male county jail population is incarcerated simply at the whim of some female. I am not kidding, I wish I was.I’d be willing to crush all this but shit, it’s white men as cops who back up the wimmin. They done made themselves my enemy too.  The day might come when they wish they hadn’t.",
              "datetime": "June 11, 2025 6:59 pm",
              "vote_up": 2,
              "vote_down": 0,
              "reply_to": "461222",
              "responses": []
            }
          ]
        }
      ]
    },
    {
      "id": "461099",
      "author": "Hun",
      "comment": "How do you “completely eradicate” the Blob people, without being Hitler?",
      "datetime": "June 11, 2025 8:32 am",
      "vote_up": 6,
      "vote_down": 0,
      "reply_to": null,
      "responses": [
        {
          "id": "461100",
          "author": "Dr_Mantis_Tobbogan_MD",
          "comment": "They can always be ejected from this country and sent to their ethnostate.",
          "datetime": "June 11, 2025 8:34 am",
          "vote_up": 12,
          "vote_down": 0,
          "reply_to": "461099",
          "responses": [
            {
              "id": "461103",
              "author": "Hun",
              "comment": "By magic? Or how? Somebody must actually do that, not just talk. And that somebody has to be absolutely exceptional and very extreme by today’s pussified standards.",
              "datetime": "June 11, 2025 8:38 am",
              "vote_up": 16,
              "vote_down": 0,
              "reply_to": "461100",
              "responses": [
                {
                  "id": "461173",
                  "author": "Compsci",
                  "comment": "To your question, take a look at how Putin handled his oligarchs when he assumed power.  It can be done—even here.",
                  "datetime": "June 11, 2025 10:50 am",
                  "vote_up": 4,
                  "vote_down": 0,
                  "reply_to": "461103",
                  "responses": [
                    {
                      "id": "461183",
                      "author": "Hun",
                      "comment": "A lot more needs to be done than what Putin did. He only removed a few powerful individuals. They will be back. At the same time, Russia is still being invaded from the south.",
                      "datetime": "June 11, 2025 11:06 am",
                      "vote_up": 1,
                      "vote_down": 0,
                      "reply_to": "461173",
                      "responses": [
                        {
                          "id": "461258",
                          "author": "Compsci",
                          "comment": "The ones he took on had gotten a stranglehold of essential elements of a strong centralized government and in essence held assets which rightfully belonged to the people.  For example, natural resources like oil and gas.\nThat he allowed some business gurus like the oligarch who owns Sky vodka seems secondary to the issue.\nBut yes, he does have friction with those types from time to time, but I’m not sure they play a significant role in his guidance of a strong Russian State.",
                          "datetime": "June 11, 2025 1:15 pm",
                          "vote_up": 3,
                          "vote_down": 0,
                          "reply_to": "461183",
                          "responses": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "461110",
              "author": "Jack Dodson",
              "comment": "Yeah, it has been done countless times without a world war.",
              "datetime": "June 11, 2025 8:47 am",
              "vote_up": 10,
              "vote_down": 0,
              "reply_to": "461100",
              "responses": []
            },
            {
              "id": "461260",
              "author": "Alzaebo",
              "comment": "A Havarra Transfer program for America!  We’ll give you your money, but only when you’ve arrived in your ethnostate.\nSince they are fully vested in the Atrocity Story used to scare them into going, with the lure of world rule from Jerusalem’s throne as their vision, it’s slightly possible we might get more cooperation this time…\nNah.  They only stridently believe their own bullshit as long as it serves their purpose.",
              "datetime": "June 11, 2025 1:28 pm",
              "vote_up": 3,
              "vote_down": 0,
              "reply_to": "461100",
              "responses": []
            }
          ]
        },
        {
          "id": "461104",
          "author": "Mr. House",
          "comment": "You don’t, just like most here think they can have change and keep their 401k intact.",
          "datetime": "June 11, 2025 8:40 am",
          "vote_up": 6,
          "vote_down": 0,
          "reply_to": "461099",
          "responses": [
            {
              "id": "461136",
              "author": "Grant",
              "comment": "The 401k thing is actually more important than people give credit to. Who’s the largest wealth-management firm? Vanguard. Who owns a controlling interest in Vanguard? Blackrock. Who owns a controlling interest in Blackrock? Vanguard. Your 401k has been used, much like tax dollars in USAID, to destabilize Western countries. If we had a sane world, there would be massive class-action lawsuits against these investment firms as they’ve used their board positions to advocate for insane money-losing “go woke go broke” positions in firms. Your 401k has lost money as a result of Vanguard et. all showing up to shareholder meetings and demanding that She-Hulk get greenlit. That’s a clear violation of their fiduciary duty to their investors i.e. you. There’s no way to deal with these parasites without demolishing the current retirement investment apparatus. 404k: retirement funds not found.",
              "datetime": "June 11, 2025 9:30 am",
              "vote_up": 21,
              "vote_down": 0,
              "reply_to": "461104",
              "responses": [
                {
                  "id": "461143",
                  "author": "Mr. House",
                  "comment": "Exactly. The devil doesn’t steal your soul by telling you hell is awful. He makes promises he has no intention of keeping. Just like the stock market 😉Take your logic to the next level: Why would companies care about going woke? They’ll get bailed out when trouble arises, so why would they care? Who’s tune are they dancing to? Did you bailout them out? Technically you did, but do you control the purse of .gov?Either we let deflation happen, or you’re just going to get more of the same.  The money for these riots Zman is currently writing about wouldn’t exist if limits existed on how much .gov can print.  Just saying",
                  "datetime": "June 11, 2025 9:49 am",
                  "vote_up": 4,
                  "vote_down": 0,
                  "reply_to": "461136",
                  "responses": [
                    {
                      "id": "461254",
                      "author": "CorkyAgain",
                      "comment": "Show the CEO’s and board members who personally suffered financially or otherwise when their companies went bankrupt, lost market share, or otherwise went out of business.\nAs far as I can see, most of them just move on to the next one, taking their bags of loot with them.",
                      "datetime": "June 11, 2025 1:09 pm",
                      "vote_up": 5,
                      "vote_down": 0,
                      "reply_to": "461143",
                      "responses": [
                        {
                          "id": "461274",
                          "author": "Mr. House",
                          "comment": "Yep, and i would also reform corporate bankruptcy to actually have teeth.  No so some connected group of investors can buy up the assets for pennies on the dollar.",
                          "datetime": "June 11, 2025 2:37 pm",
                          "vote_up": 3,
                          "vote_down": 0,
                          "reply_to": "461254",
                          "responses": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "461262",
                  "author": "ray",
                  "comment": "‘Go Woke, go broke’.  The NormieCons are such dolts.\nWipe Vanguard and Blackrock off the board. Shutter their offices. They are anti-God, anti-American insurgents no different than rioting mestizos or pussy parade shrews.\nJail their executives. Liquidate their holdings and rebate them to Americans living longer than 40 years in the nation. Or just to white males with income below $100,000 a year. Seeing as how those are the persons who have been disenfranchised, falsely accused, falsely imprisoned, and generally persecuted for the past half-century.\nWhen the DNC inevitably squeals? Lock them up too.",
                  "datetime": "June 11, 2025 1:43 pm",
                  "vote_up": 11,
                  "vote_down": 0,
                  "reply_to": "461136",
                  "responses": []
                }
              ]
            }
          ]
        },
        {
          "id": "461108",
          "author": "Arthur Bryan",
          "comment": "Indeed, that may be a necessary condition for our survival.",
          "datetime": "June 11, 2025 8:45 am",
          "vote_up": 4,
          "vote_down": 0,
          "reply_to": "461099",
          "responses": []
        },
        {
          "id": "461120",
          "author": "mmack",
          "comment": "Be like Stalin?\n“No man, no problem.”",
          "datetime": "June 11, 2025 9:00 am",
          "vote_up": 8,
          "vote_down": 0,
          "reply_to": "461099",
          "responses": []
        },
        {
          "id": "461131",
          "author": "ray",
          "comment": "It’s the Blob that is calling you Hitler, because long ago they learned that shaming and guilting men is the way to control them.  It works!\nDo what is necessary and let them call you anything they like.  Their Medea is gonna spin you as a monster anyway.  Laugh uproariously and roll with it.",
          "datetime": "June 11, 2025 9:21 am",
          "vote_up": 18,
          "vote_down": 0,
          "reply_to": "461099",
          "responses": [
            {
              "id": "461148",
              "author": "Hun",
              "comment": "I meant it both ways – any person doing what is necessary will be called Hitler and at the same time, he absolutely should be like Hitler, because that is what it takes. There is no nice political solution, nothing that is considered polite in today’s society.\nPeople need to stop being afraid, not just of being called Hitler, but they need to stop being afraid of being like Hitler.",
              "datetime": "June 11, 2025 9:52 am",
              "vote_up": 12,
              "vote_down": 0,
              "reply_to": "461131",
              "responses": [
                {
                  "id": "461267",
                  "author": "ray",
                  "comment": "I am not seeking to emulate Hitler, but you are so correct, men need to stop living in fear and do what is right and necessary.",
                  "datetime": "June 11, 2025 2:10 pm",
                  "vote_up": 3,
                  "vote_down": 0,
                  "reply_to": "461148",
                  "responses": []
                }
              ]
            }
          ]
        },
        {
          "id": "461166",
          "author": "T. Morris",
          "comment": "Apparently you haven’t read a little book titledGermany Must Perish. One needn’t be Hitler to dream up creative, plausibly workable ways of exterminating whole peoples (granting your point that carrying it out is a different story)…",
          "datetime": "June 11, 2025 10:37 am",
          "vote_up": 3,
          "vote_down": 0,
          "reply_to": "461099",
          "responses": []
        }
      ]
    },
    {
      "id": "461304",
      "author": "Unknownsailor",
      "comment": "8 USC Section 1324 is the key to this: Charge business CEOs and apartment managers with this, send them to prison, and suddenly, employers and landlords are a lot less willing to hire or house Mamacita with obvious fake papers anymore.",
      "datetime": "June 11, 2025 5:21 pm",
      "vote_up": 5,
      "vote_down": 0,
      "reply_to": null,
      "responses": []
    },
    {
      "id": "461175",
      "author": "GenghisKhan",
      "comment": "Dismantle the healthcare system.\nWatch the Blob people die in record speed.\nCovid-19 (a superflu) made clear what they truly fear.",
      "datetime": "June 11, 2025 10:52 am",
      "vote_up": 5,
      "vote_down": 0,
      "reply_to": null,
      "responses": []
    },
    {
      "id": "461140",
      "author": "JayBee",
      "comment": "Good, scary article on the AI part of yours here:https://brownstone.org/articles/the-prisoners-dilemma-of-ai/The reporting or rather framing of the German MSM on this can be summed up as: Trump the evil dictator, Newsom the good guy, protests are entirely peaceful and all about opposing Trump’s dictatorship.",
      "datetime": "June 11, 2025 9:37 am",
      "vote_up": 5,
      "vote_down": 0,
      "reply_to": null,
      "responses": []
    },
    {
      "id": "461269",
      "author": "Dutchboy",
      "comment": "Immigration cutoffs or moratoria won’t do anymore. There must be an aggressive program of repatriation. It’s too late in the day for anything else.",
      "datetime": "June 11, 2025 2:21 pm",
      "vote_up": 4,
      "vote_down": 0,
      "reply_to": null,
      "responses": []
    },
    {
      "id": "461207",
      "author": "TomA",
      "comment": "The Deep State spends its financial resources on mobilizing dysfunctional white liberals for chaos duty at manufactured riots. This is largely aimed at controlling the narrative, and by extension, political power. The war in Ukraine is coming to an end and there will soon be thousands of unemployed and pissed off drone builders and operators. In theory, this untapped resource could be financially incentivized to dissuade the pathogens from their evil ways. Think outside the box.",
      "datetime": "June 11, 2025 11:48 am",
      "vote_up": 4,
      "vote_down": 0,
      "reply_to": null,
      "responses": []
    },
    {
      "id": "461181",
      "author": "Mr. House",
      "comment": "@Ray\nThis is a women that gets it.  Found this posted on another site i read and thought you might enjoy it:\nhttps://thelastpsychiatrist.com/2014/05/cyberbll.html#more",
      "datetime": "June 11, 2025 11:05 am",
      "vote_up": 4,
      "vote_down": 0,
      "reply_to": null,
      "responses": [
        {
          "id": "461230",
          "author": "Mr. House",
          "comment": "Not sure why i got a downvote, but when an author writes this, i listen:  “The system’s ideal woman is the single mother, she’s produced with her uterus and is willing to go all in on production/consumption, she has no choice. I’m not saying she wants to be a single mother, I’m saying that’s what the system wants her to be. That’s feminism. You can get married too, as long as he’ll make it so you get in at 8.”",
          "datetime": "June 11, 2025 12:25 pm",
          "vote_up": 4,
          "vote_down": 0,
          "reply_to": "461181",
          "responses": []
        },
        {
          "id": "461276",
          "author": "ray",
          "comment": "Thank you.‘The barrier is in herself, sexism is merely her projection of it.’The epitaph of the U.S.It’s hilarious but typical to see privileged princesses in the U.S. rage and thrash about a ‘patriarchy’ that does not exist, except in their needful delusions. Back in the Seventies when women started to trot out the ‘that offends me’ command to every word and act they didn’t approve of, I could see where all this was going. Couldn’t stop it, tho.Harpy Hess lives in a gynocracy in which females and female concerns rule EVERY U.S. institution, with possible exception of the Executive . . . but Medea and College say it’s a patriarchy, and the Aggrieved Victim in Hess likes that juicy dramatic role, and knows it produces goodies from weak men lost in the ghettos of Romanticism and female moral superiority (i.e., most dork righty men).If America was a horse I’d have shot it long ago.",
          "datetime": "June 11, 2025 2:42 pm",
          "vote_up": 5,
          "vote_down": 0,
          "reply_to": "461181",
          "responses": [
            {
              "id": "461279",
              "author": "Mr. House",
              "comment": "I take it you enjoyed it, i’m reading some of her other articles, all rather good.  She has quite the wit, i find myself laughing out loud quite a bit.  For example:To understand exactly why “feminism” or whatever Valenti thinks she has re-invented has not only stalled, but is damaging to all humanity, all you need to do is go to the source. Totally at random, I went toHuffington Post Women. Let’s see what the feminists are up to, here are the top five articles:1.The Reason The Academy Passed On Kathryn Bigelow(answer: sexism.)2.Confessions Of A Mistress(protip: “Here’s the wisdom I can offer to mistresses out there: do not get too attached.”)3.Why You Should Be Nervous– And Yet Not– About Sunday Night(since the Golden Globes conflict withGirls, just DVRGirls, and anyway Lena Dunham will be at the Globes.)4.‘Girls’ Star Talks Nudity And Season 2(I refused to even click it)5.Meet The Woman Who’s Only Eating From Starbucks",
              "datetime": "June 11, 2025 3:21 pm",
              "vote_up": 2,
              "vote_down": 0,
              "reply_to": "461276",
              "responses": [
                {
                  "id": "461324",
                  "author": "ray",
                  "comment": "Arianna Huffington should be made to walk the plank. Though the sea just might spit her back out.\nThe damage that bitter monster has done to this world and nation is vast. Feminism was a Death Cult and a Hate Movement from the beginning.",
                  "datetime": "June 11, 2025 8:03 pm",
                  "vote_up": 3,
                  "vote_down": 0,
                  "reply_to": "461279",
                  "responses": [
                    {
                      "id": "461471",
                      "author": "Alzaebo",
                      "comment": "At least Arianna got rich enough from divorcing her gay husband to buy a ‘newspaper’, so there is justice in this patriarchal world!",
                      "datetime": "June 12, 2025 11:39 am",
                      "vote_up": 0,
                      "vote_down": 0,
                      "reply_to": "461324",
                      "responses": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "461290",
          "author": "ProZNoV",
          "comment": "The Last Psychiatrist was classic.\nReally good stuff on how we are willingly manipulated.\nQuit before his time (doxed, in the years when that was professional death)",
          "datetime": "June 11, 2025 3:55 pm",
          "vote_up": 1,
          "vote_down": 0,
          "reply_to": "461181",
          "responses": [
            {
              "id": "461293",
              "author": "Mr. House",
              "comment": "Ah so its a dude, i thought it was a chick.  I’m surprised i never came across this until now.",
              "datetime": "June 11, 2025 4:09 pm",
              "vote_up": 1,
              "vote_down": 0,
              "reply_to": "461290",
              "responses": []
            }
          ]
        }
      ]
    },
    {
      "id": "461295",
      "author": "Danny 2.0",
      "comment": "“the two most moderate men on the internet, myself and Paul Ramsey”\nExactly why I tune in!",
      "datetime": "June 11, 2025 4:21 pm",
      "vote_up": 3,
      "vote_down": 0,
      "reply_to": null,
      "responses": []
    },
    {
      "id": "461176",
      "author": "ProZNoV",
      "comment": "They’re setting the stage for another Ukraine style Maidan Massacre, which, just like in Ukraine, it will never be clear who caused it…but a false narrative will emerge instantly an the truth won’t ever be known…but the blob will mysteriously come out on top.I doubt less than 25% of the American public has any concept of what a “color revolution” is, much less recognizes the completely obvious one going on right now.To the politically savvy, it’s obvious what’s going on now is a run that will piggyback on the June 14 “NoKing” rallies (totally inorganic). Small crowds will be made to look huge.The next step is to provoke a violent response from the government in response to “peaceful demonstrators.”  Left out, or downplayed, will be the 1% of aggitators who are trained on how to escalate to prove a reaction.If that doesn’t work, you may be sure SOMETHING will happen.  It will be made to happen.The “legume” revolution is funny, but they’re actually going to run this by rallying 30+ million illegal and an equal amount of white shitlibs to the MEXICAN FLAG.Putting a rag on a flag, planting it in a hill or an idea, an telling the people to rally to it is cliche…but it works.Dark days ahead.",
      "datetime": "June 11, 2025 10:56 am",
      "vote_up": 3,
      "vote_down": 0,
      "reply_to": null,
      "responses": [
        {
          "id": "461205",
          "author": "Jack Dodson",
          "comment": "I don’t discount any of that and it seems plausible, but so far there has been a well-coordinated response to such things, and frankly a willingness to escalate. An attempted Color Revolution again probably ends in disaster for them, and don’t discount prolonged martial law or something of that magnitude in response. Most people would have opposed that in 2020 but would not this time. The majority will be supportive or indifferent.Note that in addition to the marginal propaganda organs downplaying what is happening, the Trump Administration also is overplaying the magnitude of it. There is a reason for that. Anything can happen but if forced to bet it would be on the Left failing epically. I never previously would have bet that way.",
          "datetime": "June 11, 2025 11:47 am",
          "vote_up": 3,
          "vote_down": 0,
          "reply_to": "461176",
          "responses": [
            {
              "id": "461474",
              "author": "Alzaebo",
              "comment": "At least we’ll finally get our Hitler…\nJD Hamel Bowman Vance and Technocratic National Socialism, a new order for the ages.  The Palantir Juden elite will finally be able to fulfill their Morganthau Holocaust, and Jerusalem’s reign will begin.",
              "datetime": "June 12, 2025 11:46 am",
              "vote_up": 0,
              "vote_down": 0,
              "reply_to": "461205",
              "responses": []
            }
          ]
        }
      ]
    },
    {
      "id": "461114",
      "author": "Arshad Ali",
      "comment": "“The relatively muted response to this point has had many people scratching their heads.”Perhaps somemodus vivendiwas a precondition for allowing him the job? Certainly he appears to be in more emollient mode than the first time around.“At this point, it is clear that the Los Angeles riot is synthetic.”Yep, it’s carefully orchestrated. Are there any spontaneous insurrections these days?“In this case, it highlights the fact that our rulers abetted an invasion.”Many liberals will not make the connection, or will seek to elide over it. And of course they’ll make the counterargument that there were millions of illegal aliens before the Biden years.“That leaves the rioting to the twenty-something white losers the Blob relies on as foot soldiers. Now, the blacks are taking advantage of the opportunity and looting the sneaker stores.”Agree entirely. Note how the networks are not mentioning the ethnic composition of the rioters. As you say, legal immigrants just want to keep their heads down, get on with their work and their lives, and not attract attention from the authorities. Illegal aliens just want to avoid any scrutiny whatsoever — or it’s the next bus or plane back home.On a side note I think someone here was mentioning that California is now majority non-white. A hurried Google check indicates 34% and declining. Before the Mexican-American war, it was part of Mexico. It’s notutterlyinconceivable that it one day secede. In Richard Morgan’s sci-fi novel, “13”, set a century in the future, the states of California, Oregon, and Washington have split off to form the “Pacific Rim.” The northeast and northern states have amalgamated with Canada to form the “North Atlantic Union.” What remains is the “Republic”, though as the story goes on, Arizona also applies to join the Rim.",
      "datetime": "June 11, 2025 8:55 am",
      "vote_up": 3,
      "vote_down": 0,
      "reply_to": null,
      "responses": [
        {
          "id": "461220",
          "author": "Jack Dodson",
          "comment": "They aren’t 20-something for the most part. More like 30ish. That’s a tell.",
          "datetime": "June 11, 2025 12:12 pm",
          "vote_up": 4,
          "vote_down": 0,
          "reply_to": "461114",
          "responses": []
        }
      ]
    },
    {
      "id": "461194",
      "author": "Krustykurmudgeon",
      "comment": "i think the left is betting on having paid off the local and federal trial court judges to either rule in favor of the defense – or to let on jurors to hang the case",
      "datetime": "June 11, 2025 11:19 am",
      "vote_up": 2,
      "vote_down": 0,
      "reply_to": null,
      "responses": []
    },
    {
      "id": "461335",
      "author": "Hi-ya!",
      "comment": "America is not a proper country. It has no people it serves just random individuals who somehow got here and filled in some forms. If Reagan’s view of woman amemrican  is is the view of most people, then I support foreign flags, at least they mean something",
      "datetime": "June 12, 2025 6:50 am",
      "vote_up": 1,
      "vote_down": 0,
      "reply_to": null,
      "responses": []
    },
    {
      "id": "461323",
      "author": "el_baboso",
      "comment": "Well said, Z man!",
      "datetime": "June 11, 2025 7:52 pm",
      "vote_up": 1,
      "vote_down": 0,
      "reply_to": null,
      "responses": []
    },
    {
      "id": "461291",
      "author": "Whiskey",
      "comment": "I live in SoCal. Bass and Newsom are on TV all the time, three or four times a day. They are loving this. Bass in particular seems to hope LA gets burned down so she can redevelop with that sweet, sweet redevelopment money and power. The ideal city is one comprised of criminal illegal aliens and homeless, and Bass views the riots as well on her way to achieving that goal.Moreover the rabid defense of illegals is based on both voting and census, so they cannot back down or they lose Congressmen and money.Newsom gave a speech, he boasted that he is part of the resistance (he had to post it twice, original feed had no audio). The goal is nationwide riots on Saturday, with the goal of removing Trump as they nearly did last time.The center of gravity is not the public. Nor the oligarchs. It is the news media: 100% peaceful protest, the judges, and the rented mobs. I would not be shocked if the whole thing was done to have a Judge rule open borders forever, and take over the Presidency. Bass and Newsom are arguing that ANY ICE raids are “inflammatory” and must end forever, or there will be more violence. This is the talking point for the pre-arranged Judge to rule. With a nationwide injunction on any arrests or raids of illegals, open borders, and control of the military going to said judge. This seems to be the play at any rate as I see it from SoCal. I have no idea of what is going on besides this.Interestingly Santa Ana and other places in Orange County are seeing riots, they did NOT have that during the Summer of George five years ago.",
      "datetime": "June 11, 2025 4:02 pm",
      "vote_up": 0,
      "vote_down": 0,
      "reply_to": null,
      "responses": [
        {
          "id": "461479",
          "author": "Alzaebo",
          "comment": "“Bass in particular seems to hope LA gets burned down so she can redevelop with that sweet, sweet redevelopment money and power.”When South Central ‘burned’ for Rodney King (small black shops looted by their diverse neighbors), Maxine Waters’ district was rezoned as an ‘economic development zone’; the Asians cleared out the old, decrepit blocks and put up big, gleaming warehouses with 12′ iron fences and gold lettering in Korean and Chinese script.You can surely bet Maxine Waters’ bank was right in the middle of all that hot redevelopment action.  Karen Bass of the Cuban Venceremos Brigade must be drooling at the thought.",
          "datetime": "June 12, 2025 11:58 am",
          "vote_up": 0,
          "vote_down": 0,
          "reply_to": "461291",
          "responses": []
        }
      ]
    }
  ]
}